MikroElektronika/core_packages/ARM/gcc_clang/def/renesas/R7FA8D1BHDCBD/mcu.h
        struct
        {
            __IM uint16_t CDLK0  : 1;               /*!< [0..0] Configuration Data Lock Bit                                        */
            __IM uint16_t CDLK1  : 1;               /*!< [1..1] Configuration Data Lock Bit                                        */
            __IM uint16_t CDLK2  : 1;               /*!< [2..2] Configuration Data Lock Bit                                        */
            __IM uint16_t CDLK3  : 1;               /*!< [3..3] Configuration Data Lock Bit                                        */
            __IM uint16_t CDLK4  : 1;               /*!< [4..4] Configuration Data Lock Bit                                        */
            __IM uint16_t CDLK5  : 1;               /*!< [5..5] Configuration Data Lock Bit                                        */
            __IM uint16_t CDLK6  : 1;               /*!< [6..6] Configuration Data Lock Bit                                        */
            __IM uint16_t CDLK7  : 1;               /*!< [7..7] Configuration Data Lock Bit                                        */
            __IM uint16_t CDLK8  : 1;               /*!< [8..8] Configuration Data Lock Bit                                        */
            __IM uint16_t CDLK9  : 1;               /*!< [9..9] Configuration Data Lock Bit                                        */
            __IM uint16_t CDLK10 : 1;               /*!< [10..10] Configuration Data Lock Bit                                      */
            __IM uint16_t CDLK11 : 1;               /*!< [11..11] Configuration Data Lock Bit                                      */
            __IM uint16_t CDLK12 : 1;               /*!< [12..12] Configuration Data Lock Bit                                      */
            __IM uint16_t CDLK13 : 1;               /*!< [13..13] Configuration Data Lock Bit                                      */
            __IM uint16_t CDLK14 : 1;               /*!< [14..14] Configuration Data Lock Bit                                      */
            __IM uint16_t CDLK15 : 1;               /*!< [15..15] Configuration Data Lock Bit                                      */
        } CFGD2_b;
    };
    __IM uint16_t RESERVED;
} R_OFS_DATAFLASH_CFGDLOCK_Type;                    /*!< Size = 20 (0x14)                                                          */

/** @} */ /* End of group Device_Peripheral_clusters */

/* =========================================================================================================================== */
/* ================                            Device Specific Peripheral Section                             ================ */
/* =========================================================================================================================== */

/** @addtogroup Device_Peripheral_peripherals
 * @{
 */

/* =========================================================================================================================== */
/* ================                                         R_ACMPHS0                                         ================ */
/* =========================================================================================================================== */

/**
 * @brief High-Speed Analog Comparator (R_ACMPHS0)
 */

typedef struct                         /*!< (@ 0x40236000) R_ACMPHS0 Structure                                        */
{
    union
    {
        __IOM uint8_t CMPCTL;          /*!< (@ 0x00000000) Comparator Control Register                                */

        struct
        {
            __IOM uint8_t CINV   : 1;  /*!< [0..0] Comparator output polarity selection                               */
            __IOM uint8_t COE    : 1;  /*!< [1..1] Comparator output enable                                           */
            __IOM uint8_t CSTEN  : 1;  /*!< [2..2] Interrupt Select                                                   */
            __IOM uint8_t CEG    : 2;  /*!< [4..3] Selection of valid edge (Edge selector)                            */
            __IOM uint8_t CDFS   : 2;  /*!< [6..5] Noise filter selection                                             */
            __IOM uint8_t HCMPON : 1;  /*!< [7..7] Comparator operation control                                       */
        } CMPCTL_b;
    };
    __IM uint8_t RESERVED[3];

    union
    {
        __IOM uint8_t CMPSEL0;         /*!< (@ 0x00000004) Comparator Input Select Register                           */

        struct
        {
            __IOM uint8_t CMPSEL : 4;  /*!< [3..0] Comparator Input Selection                                         */
            uint8_t              : 4;
        } CMPSEL0_b;
    };
    __IM uint8_t RESERVED1[3];

    union
    {
        __IOM uint8_t CMPSEL1;         /*!< (@ 0x00000008) Comparator Reference Voltage Select Register               */

        struct
        {
            __IOM uint8_t CRVS : 6;    /*!< [5..0] Reference Voltage Selection                                        */
            uint8_t            : 2;
        } CMPSEL1_b;
    };
    __IM uint8_t RESERVED2[3];

    union
    {
        __IM uint8_t CMPMON;           /*!< (@ 0x0000000C) Comparator Output Monitor Register                         */

        struct
        {
            __IM uint8_t CMPMON : 1;   /*!< [0..0] Comparator output monitor                                          */
            uint8_t             : 7;
        } CMPMON_b;
    };
    __IM uint8_t RESERVED3[3];

    union
    {
        __IOM uint8_t CPIOC;           /*!< (@ 0x00000010) Comparator Output Control Register                         */

        struct
        {
            __IOM uint8_t CPOE   : 1;  /*!< [0..0] Comparator output selection                                        */
            uint8_t              : 6;
            __IOM uint8_t VREFEN : 1;  /*!< [7..7] Internal Vref enable                                               */
        } CPIOC_b;
    };
    __IM uint8_t RESERVED4[47];

    union
    {
        __IOM uint8_t CPINTCTL;        /*!< (@ 0x00000040) Comparator Interrupt Control Register                      */

        struct
        {
            __IOM uint8_t MSKE : 1;    /*!< [0..0] Comparator Interrupt Periodic Mask Enable                          */
            uint8_t            : 7;
        } CPINTCTL_b;
    };
    __IM uint8_t RESERVED5[3];

    union
    {
        __IOM uint8_t CPMSKCTL;        /*!< (@ 0x00000044) Comparator Interrupt Mask Control Register                 */

        struct
        {
            __IOM uint8_t MSKSEL : 3;  /*!< [2..0] Comparator Interrupt Periodic Mask Enable                          */
            uint8_t              : 5;
        } CPMSKCTL_b;
    };
} R_ACMPHS0_Type;                      /*!< Size = 69 (0x45)                                                          */

/* =========================================================================================================================== */
/* ================                                          R_ADC0                                           ================ */
/* =========================================================================================================================== */

/**
 * @brief A/D Converter (R_ADC0)
 */

