MikroElektronika/core_packages/ARM/gcc_clang/def/renesas/R7FA8D1BHDCBD/mcu.h
        struct
        {
            __IOM uint32_t CPEIE   : 1; /*!< [0..0] One-Frame Capture End Interrupt Enable                             */
            __IOM uint32_t CFEIE   : 1; /*!< [1..1] CFE Interrupt Enable                                               */
            uint32_t               : 2;
            __IOM uint32_t IGRWIE  : 1; /*!< [4..4] Register-Access-During-Capture Interrupt Enable                    */
            uint32_t               : 3;
            __IOM uint32_t HDIE    : 1; /*!< [8..8] HD Interrupt Enable                                                */
            __IOM uint32_t VDIE    : 1; /*!< [9..9] VD Interrupt Enable                                                */
            uint32_t               : 2;
            __IOM uint32_t CPBE1IE : 1; /*!< [12..12] CPBE1 Interrupt Enable                                           */
            __IOM uint32_t CPBE2IE : 1; /*!< [13..13] CPBE2 Interrupt Enable                                           */
            __IOM uint32_t CPBE3IE : 1; /*!< [14..14] CPBE3 Interrupt Enable                                           */
            __IOM uint32_t CPBE4IE : 1; /*!< [15..15] CPBE4 Interrupt Enable                                           */
            __IOM uint32_t CDTOFIE : 1; /*!< [16..16] CDTOF Interrupt Enable                                           */
            __IOM uint32_t IGHSIE  : 1; /*!< [17..17] IGHS Interrupt Enable                                            */
            __IOM uint32_t IGVSIE  : 1; /*!< [18..18] IGVS Interrupt Enable                                            */
            uint32_t               : 1;
            __IOM uint32_t VBPIE   : 1; /*!< [20..20] VBP Interrupt Enable                                             */
            uint32_t               : 2;
            __IOM uint32_t FWFIE   : 1; /*!< [23..23] FWF Interrupt Enable                                             */
            __IOM uint32_t NHDIE   : 1; /*!< [24..24] Non-HD Interrupt Enable                                          */
            __IOM uint32_t NVDIE   : 1; /*!< [25..25] Non-VD Interrupt Enable                                          */
            uint32_t               : 6;
        } CEIER_b;
    };

    union
    {
        __IOM uint32_t CETCR;          /*!< (@ 0x00000074) Capture Event Flag Clear Register                          */

        struct
        {
            __IOM uint32_t CPE : 1;    /*!< [0..0] An interrupt indicating that capturing of one frame from
                                        *   an external module has finished.                                          */
            __IOM uint32_t CFE : 1;    /*!< [1..1] An interrupt indicating that capturing of one field from
                                        *   an external module has finished.                                          */
            uint32_t            : 2;
            __IOM uint32_t IGRW : 1;   /*!< [4..4] An interrupt indicating that during capturing, access
                                        *   was attempted to a register to which writing during operation
                                        *   is prohibited.                                                            */
            uint32_t          : 3;
            __IOM uint32_t HD : 1;     /*!< [8..8] An interrupt indicating that HD (horizontal sync signal)
                                        *   was input from an external module.                                        */
            __IOM uint32_t VD : 1;     /*!< [9..9] An interrupt indicating that VD (vertical sync signal)
                                        *   was input from an external module.                                        */
            uint32_t             : 2;
            __IOM uint32_t CPBE1 : 1;  /*!< [12..12] An interrupt indicating that writing to CDAYR and CDACR
                                        *   in a bundle write has finished.                                           */
            __IOM uint32_t CPBE2 : 1;  /*!< [13..13] An interrupt indicating that writing to CDAYR2 and
                                        *   CDACR2 in a bundle write has finished.                                    */
            __IOM uint32_t CPBE3 : 1;  /*!< [14..14] An interrupt indicating that writing to CDBYR and CDBCR
                                        *   in a bundle write has finished.                                           */
            __IOM uint32_t CPBE4 : 1;  /*!< [15..15] An interrupt indicating that writing to CDBYR2 and
                                        *   CDBCR2 in a bundle write has finished.                                    */
            __IOM uint32_t CDTOF : 1;  /*!< [16..16] An interrupt indicating that data overflowed in the
                                        *   CRAM of the write buffer                                                  */
            __IOM uint32_t IGHS : 1;   /*!< [17..17] An interrupt generated when the number of HD cycles
                                        *   set in CMCYR differ from the number of HD cycles input
                                        *   from an external module.                                                  */
            __IOM uint32_t IGVS : 1;   /*!< [18..18] An interrupt generated when the number of VD cycles
                                        *   set in CMCYR differ from the number of VD cycles input
                                        *   from an external module.                                                  */
            uint32_t           : 1;
            __IOM uint32_t VBP : 1;    /*!< [20..20] An interrupt indicating that VD has been input while
                                        *   the CEU holds data (insufficient vertical-sync front porch).              */
            uint32_t           : 2;
            __IOM uint32_t FWF : 1;    /*!< [23..23] The interrupt is generated when data is written to
                                        *   the address that exceeds the value specified with CFWCR.FMV.              */
            __IOM uint32_t NHD : 1;    /*!< [24..24] An interrupt indicating that no HD was input.                    */
            __IOM uint32_t NVD : 1;    /*!< [25..25] An interrupt indicating that no VD was input.                    */
            uint32_t           : 6;
        } CETCR_b;
    };
    __IM uint32_t RESERVED3;

    union
    {
        __IM uint32_t CSTSR;           /*!< (@ 0x0000007C) Capture Status Register                                    */

        struct
        {
            __IM uint32_t CPTON : 1;   /*!< [0..0] Indicates that the CEU is operating.                               */
            uint32_t            : 15;
            __IM uint32_t CPFLD : 1;   /*!< [16..16] Indicates which field is being captured.                         */
            uint32_t            : 7;
            __IM uint32_t CRST  : 1;   /*!< [24..24] Indicates which register plane is currently used.                */
            uint32_t            : 7;
        } CSTSR_b;
    };
    __IM uint32_t RESERVED4;

    union
    {
        __IM uint32_t CDSSR;           /*!< (@ 0x00000084) Capture Data Size Register                                 */

        struct
        {
            __IM uint32_t CDSS : 32;   /*!< [31..0] Indicate the size of data written to the memory in data
                                        *   enable fetch.                                                             */
        } CDSSR_b;
    };
    __IM uint32_t RESERVED5[2];

    union
    {
        __IOM uint32_t CDAYR2;         /*!< (@ 0x00000090) Capture Data Address Y Register 2                          */

        struct
        {
            __IOM uint32_t CAYR2 : 32; /*!< [31..0] Capture Data Address Y                                            */
        } CDAYR2_b;
    };

    union
    {
        __IOM uint32_t CDACR2;         /*!< (@ 0x00000094) Capture Data Address C Register 2                          */

        struct
        {
            __IOM uint32_t CACR2 : 32; /*!< [31..0] Capture Data Address C2                                           */
        } CDACR2_b;
    };

    union
    {
        __IOM uint32_t CDBYR2;         /*!< (@ 0x00000098) Capture Data Bottom-Field Address Y Register
                                        *                  2                                                          */

        struct
        {
            __IOM uint32_t CBYR2 : 32; /*!< [31..0] Set the address for storing the Y component data of
                                        *   the captured bottom-field data (4-pixel units).                           */
        } CDBYR2_b;
    };

    union
    {
        __IOM uint32_t CDBCR2;         /*!< (@ 0x0000009C) Capture Data Bottom-Field Address C Register
                                        *                  2                                                          */

        struct
        {
            __IOM uint32_t CBCR2 : 32; /*!< [31..0] Set the address for storing the C component data of
                                        *   the captured bottom-field data (4-pixel units).                           */
        } CDBCR2_b;
    };

    union
    {
        __IOM uint32_t AXIBUSCTL2;      /*!< (@ 0x000000A0) AXI Bus Control Register 2                                 */

        struct
        {
            __IOM uint32_t AWCACHE : 4; /*!< [3..0] AWCACHE[3:0] Signals for Capture Engine Unit                       */
            uint32_t               : 28;
        } AXIBUSCTL2_b;
    };
    __IM uint32_t RESERVED6[987];

    union
    {
        __IOM uint32_t CAMOR_B;        /*!< (@ 0x00001010) Capture Interface Offset Register                          */

        struct
        {
            __IOM uint32_t HOFST : 13; /*!< [12..0] Specify the capture start location in terms of the number
                                        *   of clock cycles from a horizontal sync signal (1-cycle
                                        *   units).                                                                   */
            uint32_t             : 3;
            __IOM uint32_t VOFST : 12; /*!< [27..16] Specify the capture start location in terms of the
                                        *   HD count from a vertical sync signal (1-HD units).                        */
            uint32_t : 4;
        } CAMOR_B_b;
    };

    union
    {
        __IOM uint32_t CAPWR_B;        /*!< (@ 0x00001014) Capture Interface Width Register                           */

        struct
        {
            __IOM uint32_t HWDTH : 13; /*!< [12..0] Specify the horizontal capture period.                            */
            uint32_t             : 3;
            __IOM uint32_t VWDTH : 12; /*!< [27..16] Specify the vertical capture period (4-HD units).                */
            uint32_t             : 4;
        } CAPWR_B_b;
    };
    __IM uint32_t RESERVED7[6];

    union
    {
        __IOM uint32_t CFLCR_B;        /*!< (@ 0x00001030) Capture Filter Control Register                            */

        struct
        {
            __IOM uint32_t HFRAC : 12; /*!< [11..0] Fraction Part of Horizontal Scale-Down Factor                     */
            __IOM uint32_t HMANT : 4;  /*!< [15..12] Mantissa Part of Horizontal Scale-Down Factor                    */
            __IOM uint32_t VFRAC : 12; /*!< [27..16] Fraction Part of Vertical Scale-Down Factor                      */
            __IOM uint32_t VMANT : 4;  /*!< [31..28] Mantissa Part of Vertical Scale-Down Factor                      */
        } CFLCR_B_b;
    };

    union
    {
        __IOM uint32_t CFSZR_B;        /*!< (@ 0x00001034) Capture Filter Size Clip Register                          */

        struct
        {
            __IOM uint32_t HFCLP : 12; /*!< [11..0] Specify the horizontal clipping value of the filter
                                        *   output size (4-pixel units).                                              */
            uint32_t             : 4;
            __IOM uint32_t VFCLP : 12; /*!< [27..16] Set the vertical clipping value of the filter output
                                        *   size (4-pixel units).                                                     */
            uint32_t : 4;
        } CFSZR_B_b;
    };

    union
    {
        __IOM uint32_t CDWDR_B;        /*!< (@ 0x00001038) Capture Destination Width Register                         */

        struct
        {
            __IOM uint32_t CHDW : 13;  /*!< [12..0] Specify the horizontal image size in the memory area
                                        *   where the captured image is to be stored (4-byte units).                  */
            uint32_t : 19;
        } CDWDR_B_b;
    };

    union
    {
        __IOM uint32_t CDAYR_B;        /*!< (@ 0x0000103C) Capture Data Address Y Register                            */

        struct
        {
            __IOM uint32_t CAYR : 32;  /*!< [31..0] Capture Data Address Y                                            */
        } CDAYR_B_b;
    };

    union
    {
        __IOM uint32_t CDACR_B;        /*!< (@ 0x00001040) Capture Data Address C Register                            */

        struct
        {
            __IOM uint32_t CACR : 32;  /*!< [31..0] Capture Data Address C                                            */
        } CDACR_B_b;
    };

    union
    {
        __IOM uint32_t CDBYR_B;        /*!< (@ 0x00001044) Capture Data Bottom-Field Address Y Register               */

        struct
        {
            __IOM uint32_t CBYR : 32;  /*!< [31..0] Set the address for storing the Y (luminance) component
                                        *   data of the captured bottom-field data (4-pixel units).                   */
        } CDBYR_B_b;
    };

    union
    {
        __IOM uint32_t CDBCR_B;        /*!< (@ 0x00001048) Capture Data Bottom-Field Address C Register               */

        struct
        {
            __IOM uint32_t CBCR : 32;  /*!< [31..0] Set the address for storing the C (chrominance) component
                                        *   data of the captured bottom-field data (4-pixel units).                   */
        } CDBCR_B_b;
    };

    union
    {
        __IOM uint32_t CBDSR_B;        /*!< (@ 0x0000104C) Capture Bundle Destination Size Register                   */

        struct
        {
            __IOM uint32_t CBVS : 23;  /*!< [22..0] Select the number of lines or number of bytes for output
                                        *   to the memory in a bundle write.                                          */
            uint32_t : 9;
        } CBDSR_B_b;
    };
    __IM uint32_t RESERVED8[4];

    union
    {
        __IOM uint32_t CLFCR_B;        /*!< (@ 0x00001060) Capture Low-Pass Filter Control Register                   */

        struct
        {
            __IOM uint32_t LPF : 1;    /*!< [0..0] Enables or disables operation of the low-pass filter.              */
            uint32_t           : 31;
        } CLFCR_B_b;
    };

    union
    {
        __IOM uint32_t CDOCR_B;        /*!< (@ 0x00001064) Capture Data Output Control Register                       */

        struct
        {
            __IOM uint32_t COBS : 1;   /*!< [0..0] Controls swapping in 8-bit units for data output from
                                        *   the CEU.                                                                  */
            __IOM uint32_t COWS : 1;   /*!< [1..1] Controls swapping in 16-bit units for data output from
                                        *   the CEU.                                                                  */
            __IOM uint32_t COLS : 1;   /*!< [2..2] Controls swapping in 32-bit units for data output from
                                        *   the CEU.                                                                  */
            uint32_t           : 1;
            __IOM uint32_t CDS : 1;    /*!< [4..4] Sets the image format when outputting the image data
                                        *   captured in the YCbCr422 format to the memory.                            */
            uint32_t           : 11;
            __IOM uint32_t CBE : 1;    /*!< [16..16] Controls the number of lines of captured data to be
                                        *   written to the memory.                                                    */
            uint32_t : 15;
        } CDOCR_B_b;
    };
    __IM uint32_t RESERVED9[10];

    union
    {
        __IOM uint32_t CDAYR2_B;       /*!< (@ 0x00001090) Capture Data Address Y Register 2                          */

        struct
        {
            __IOM uint32_t CAYR2 : 32; /*!< [31..0] Capture Data Address Y                                            */
        } CDAYR2_B_b;
    };

    union
    {
        __IOM uint32_t CDACR2_B;       /*!< (@ 0x00001094) Capture Data Address C Register 2                          */

        struct
        {
            __IOM uint32_t CACR2 : 32; /*!< [31..0] Capture Data Address C2                                           */
        } CDACR2_B_b;
    };

    union
    {
        __IOM uint32_t CDBYR2_B;       /*!< (@ 0x00001098) Capture Data Bottom-Field Address Y Register
                                        *                  2                                                          */

        struct
        {
            __IOM uint32_t CBYR2 : 32; /*!< [31..0] Set the address for storing the Y component data of
                                        *   the captured bottom-field data (4-pixel units).                           */
        } CDBYR2_B_b;
    };

    union
    {
        __IOM uint32_t CDBCR2_B;       /*!< (@ 0x0000109C) Capture Data Bottom-Field Address C Register
                                        *                  2                                                          */

        struct
        {
            __IOM uint32_t CBCR2 : 32; /*!< [31..0] Set the address for storing the C component data of
                                        *   the captured bottom-field data (4-pixel units).                           */
        } CDBCR2_B_b;
    };
    __IM uint32_t RESERVED10[988];

    union
    {
        __IOM uint32_t CAMOR_M;        /*!< (@ 0x00002010) Capture Interface Offset Register                          */

        struct
        {
            __IOM uint32_t HOFST : 13; /*!< [12..0] Specify the capture start location in terms of the number
                                        *   of clock cycles from a horizontal sync signal (1-cycle
                                        *   units).                                                                   */
            uint32_t             : 3;
            __IOM uint32_t VOFST : 12; /*!< [27..16] Specify the capture start location in terms of the
                                        *   HD count from a vertical sync signal (1-HD units).                        */
            uint32_t : 4;
        } CAMOR_M_b;
    };

    union
    {
        __IOM uint32_t CAPWR_M;        /*!< (@ 0x00002014) Capture Interface Width Register                           */

        struct
        {
            __IOM uint32_t HWDTH : 13; /*!< [12..0] Specify the horizontal capture period.                            */
            uint32_t             : 3;
            __IOM uint32_t VWDTH : 12; /*!< [27..16] Specify the vertical capture period (4-HD units).                */
            uint32_t             : 4;
        } CAPWR_M_b;
    };
    __IM uint32_t RESERVED11[6];

    union
    {
        __IOM uint32_t CFLCR_M;        /*!< (@ 0x00002030) Capture Filter Control Register                            */

        struct
        {
            __IOM uint32_t HFRAC : 12; /*!< [11..0] Fraction Part of Horizontal Scale-Down Factor                     */
            __IOM uint32_t HMANT : 4;  /*!< [15..12] Mantissa Part of Horizontal Scale-Down Factor                    */
            __IOM uint32_t VFRAC : 12; /*!< [27..16] Fraction Part of Vertical Scale-Down Factor                      */
            __IOM uint32_t VMANT : 4;  /*!< [31..28] Mantissa Part of Vertical Scale-Down Factor                      */
        } CFLCR_M_b;
    };

    union
    {
        __IOM uint32_t CFSZR_M;        /*!< (@ 0x00002034) Capture Filter Size Clip Register                          */

        struct
        {
            __IOM uint32_t HFCLP : 12; /*!< [11..0] Specify the horizontal clipping value of the filter
                                        *   output size (4-pixel units).                                              */
            uint32_t             : 4;
            __IOM uint32_t VFCLP : 12; /*!< [27..16] Set the vertical clipping value of the filter output
                                        *   size (4-pixel units).                                                     */
            uint32_t : 4;
        } CFSZR_M_b;
    };

    union
    {
        __IOM uint32_t CDWDR_M;        /*!< (@ 0x00002038) Capture Destination Width Register                         */

        struct
        {
            __IOM uint32_t CHDW : 13;  /*!< [12..0] Specify the horizontal image size in the memory area
                                        *   where the captured image is to be stored (4-byte units).                  */
            uint32_t : 19;
        } CDWDR_M_b;
    };

    union
    {
        __IOM uint32_t CDAYR_M;        /*!< (@ 0x0000203C) Capture Data Address Y Register                            */

        struct
        {
            __IOM uint32_t CAYR : 32;  /*!< [31..0] Capture Data Address Y                                            */
        } CDAYR_M_b;
    };

    union
    {
        __IOM uint32_t CDACR_M;        /*!< (@ 0x00002040) Capture Data Address C Register                            */

        struct
        {
            __IOM uint32_t CACR : 32;  /*!< [31..0] Capture Data Address C                                            */
        } CDACR_M_b;
    };

    union
    {
        __IOM uint32_t CDBYR_M;        /*!< (@ 0x00002044) Capture Data Bottom-Field Address Y Register               */

        struct
        {
            __IOM uint32_t CBYR : 32;  /*!< [31..0] Set the address for storing the Y (luminance) component
                                        *   data of the captured bottom-field data (4-pixel units).                   */
        } CDBYR_M_b;
    };

    union
    {
        __IOM uint32_t CDBCR_M;        /*!< (@ 0x00002048) Capture Data Bottom-Field Address C Register               */

        struct
        {
            __IOM uint32_t CBCR : 32;  /*!< [31..0] Set the address for storing the C (chrominance) component
                                        *   data of the captured bottom-field data (4-pixel units).                   */
        } CDBCR_M_b;
    };

    union
    {
        __IOM uint32_t CBDSR_M;        /*!< (@ 0x0000204C) Capture Bundle Destination Size Register                   */

        struct
        {
            __IOM uint32_t CBVS : 23;  /*!< [22..0] Select the number of lines or number of bytes for output
                                        *   to the memory in a bundle write.                                          */
            uint32_t : 9;
        } CBDSR_M_b;
    };
    __IM uint32_t RESERVED12[4];

    union
    {
        __IOM uint32_t CLFCR_M;        /*!< (@ 0x00002060) Capture Low-Pass Filter Control Register                   */

        struct
        {
            __IOM uint32_t LPF : 1;    /*!< [0..0] Enables or disables operation of the low-pass filter.              */
            uint32_t           : 31;
        } CLFCR_M_b;
    };

    union
    {
        __IOM uint32_t CDOCR_M;        /*!< (@ 0x00002064) Capture Data Output Control Register                       */

