MikroElektronika/core_packages/ARM/gcc_clang/def/renesas/R7FA8D1BHDCBD/mcu.h
    union
    {
        __IOM uint32_t VMHSSETR;       /*!< (@ 0x00000430) Video Mode Horizontal Size Set Register                    */

        struct
        {
            __IOM uint32_t HSA   : 12; /*!< [11..0] HSA Pixels                                                        */
            uint32_t             : 3;
            __IOM uint32_t HSPOL : 1;  /*!< [15..15] HSYNC Polarity                                                   */
            __IOM uint32_t HACT  : 15; /*!< [30..16] HACT Pixels                                                      */
            uint32_t             : 1;
        } VMHSSETR_b;
    };

    union
    {
        __IOM uint32_t VMHPSETR;       /*!< (@ 0x00000434) Video Mode Horizontal Porch Set Register                   */

        struct
        {
            __IOM uint32_t HBP : 13;   /*!< [12..0] HBP Pixels                                                        */
            uint32_t           : 3;
            __IOM uint32_t HFP : 13;   /*!< [28..16] HFP Pixels                                                       */
            uint32_t           : 3;
        } VMHPSETR_b;
    };
    __IM uint32_t RESERVED17[98];

    union
    {
        __IOM uint32_t SQCH0SET0R;     /*!< (@ 0x000005C0) Sequence Channel 0 Set 0 Register                          */

        struct
        {
            __OM uint32_t START : 1;   /*!< [0..0] Sequence Operation Start                                           */
            uint32_t            : 31;
        } SQCH0SET0R_b;
    };
    __IM uint32_t RESERVED18[3];

    union
    {
        __IM uint32_t SQCH0SR;         /*!< (@ 0x000005D0) Sequence Channel 0 Status Register                         */

        struct
        {
            uint32_t               : 2;
            __IM uint32_t RUNNING  : 1; /*!< [2..2] Sequence Operation Running Status                                  */
            uint32_t               : 1;
            __IM uint32_t AACTFIN  : 1; /*!< [4..4] All Actions Finish Interrupt Flag                                  */
            uint32_t               : 3;
            __IM uint32_t ADESFIN  : 1; /*!< [8..8] All-Descriptors Finish Interrupt Flag                              */
            uint32_t               : 7;
            __IM uint32_t DABORT   : 1; /*!< [16..16] Descriptor Abort Interrupt Flag                                  */
            uint32_t               : 2;
            __IM uint32_t SIZEERR  : 1; /*!< [19..19] Packet Size Error Interrupt Flag                                 */
            uint32_t               : 4;
            __IM uint32_t TXIBERR  : 1; /*!< [24..24] Tx Internal Bus Error Interrupt Flag                             */
            uint32_t               : 1;
            __IM uint32_t RXFERR   : 1; /*!< [26..26] Receive Fatal Error Interrupt Flag                               */
            __IM uint32_t RXFAIL   : 1; /*!< [27..27] Receive Fail Interrupt Flag                                      */
            __IM uint32_t RXPFAIL  : 1; /*!< [28..28] Receive Packet Data Fail Interrupt Flag                          */
            __IM uint32_t RXCORERR : 1; /*!< [29..29] Receive Correctable Error Interrupt Flag                         */
            __IM uint32_t RXAKE    : 1; /*!< [30..30] Receive Acknowledge and Error Report Packet Interrupt
                                         *   Flag                                                                      */
            uint32_t : 1;
        } SQCH0SR_b;
    };

    union
    {
        __IOM uint32_t SQCH0SCR;       /*!< (@ 0x000005D4) Sequence Channel 0 Status Clear Register                   */

        struct
        {
            uint32_t                : 4;
            __IOM uint32_t AACTFIN  : 1; /*!< [4..4] All Actions Finish Interrupt Flag Clear                            */
            uint32_t                : 3;
            __IOM uint32_t ADESFIN  : 1; /*!< [8..8] All-Descriptors Finish Interrupt Flag Clear                        */
            uint32_t                : 7;
            __IOM uint32_t DABORT   : 1; /*!< [16..16] Descriptor Abort Interrupt Flag Clear                            */
            uint32_t                : 2;
            __IOM uint32_t SIZEERR  : 1; /*!< [19..19] Packet Size Error Interrupt Flag Clear                           */
            uint32_t                : 4;
            __IOM uint32_t TXIBERR  : 1; /*!< [24..24] Tx Internal Bus Error Interrupt Flag Clear                       */
            uint32_t                : 1;
            __IOM uint32_t RXFERR   : 1; /*!< [26..26] Receive Fatal Error Interrupt Flag Clear                         */
            __IOM uint32_t RXFAIL   : 1; /*!< [27..27] Receive Fail Interrupt Flag Clear                                */
            __IOM uint32_t RXPFAIL  : 1; /*!< [28..28] Receive Packet Data Fail Interrupt Flag Clear                    */
            __IOM uint32_t RXCORERR : 1; /*!< [29..29] Receive Correctable Error Interrupt Flag Clear                   */
            __IOM uint32_t RXAKE    : 1; /*!< [30..30] Receive Acknowledge and Error Report Packet Interrupt
                                          *   Flag Clear                                                                */
            uint32_t : 1;
        } SQCH0SCR_b;
    };

    union
    {
        __IOM uint32_t SQCH0IER;       /*!< (@ 0x000005D8) Sequence Channel 0 Interrupt Enable Register               */

        struct
        {
            uint32_t                : 4;
            __IOM uint32_t AACTFIN  : 1; /*!< [4..4] All Actions Finish Interrupt Enable                                */
            uint32_t                : 3;
            __IOM uint32_t ADESFIN  : 1; /*!< [8..8] All-Descriptors Finish Interrupt Enable                            */
            uint32_t                : 7;
            __IOM uint32_t DABORT   : 1; /*!< [16..16] Descriptor Abort Interrupt Enable                                */
            uint32_t                : 2;
            __IOM uint32_t SIZEERR  : 1; /*!< [19..19] Packet Size Error Interrupt Enable                               */
            uint32_t                : 4;
            __IOM uint32_t TXIBERR  : 1; /*!< [24..24] Tx Internal Bus Error Interrupt Enable                           */
            uint32_t                : 1;
            __IOM uint32_t RXFERR   : 1; /*!< [26..26] Receive Fatal Error Interrupt Enable                             */
            __IOM uint32_t RXFAIL   : 1; /*!< [27..27] Receive Fail Interrupt Enable                                    */
            __IOM uint32_t RXPFAIL  : 1; /*!< [28..28] Receive Packet Data Fail Interrupt Enable                        */
            __IOM uint32_t RXCORERR : 1; /*!< [29..29] Receive Correctable Error Interrupt Enable                       */
            __IOM uint32_t RXAKE    : 1; /*!< [30..30] Receive Acknowledge and Error Report Packet Interrupt
                                          *   Enable                                                                    */
            uint32_t : 1;
        } SQCH0IER_b;
    };
    __IM uint32_t RESERVED19[9];

    union
    {
        __IOM uint32_t SQCH1SET0R;     /*!< (@ 0x00000600) Sequence Channel 1 Set 0 Register                          */

        struct
        {
            __OM uint32_t START : 1;   /*!< [0..0] Sequence Operation Start                                           */
            uint32_t            : 31;
        } SQCH1SET0R_b;
    };
    __IM uint32_t RESERVED20[3];

    union
    {
        __IM uint32_t SQCH1SR;         /*!< (@ 0x00000610) Sequence Channel 1 Status Register                         */

        struct
        {
            uint32_t               : 2;
            __IM uint32_t RUNNING  : 1; /*!< [2..2] Sequence Operation Running Status                                  */
            uint32_t               : 1;
            __IM uint32_t AACTFIN  : 1; /*!< [4..4] All Actions Finish Interrupt Flag                                  */
            uint32_t               : 3;
            __IM uint32_t ADESFIN  : 1; /*!< [8..8] All-Descriptors Finish Interrupt Flag                              */
            uint32_t               : 7;
            __IM uint32_t DABORT   : 1; /*!< [16..16] Descriptor Abort Interrupt Flag                                  */
            uint32_t               : 2;
            __IM uint32_t SIZEERR  : 1; /*!< [19..19] Packet Size Error Interrupt Flag                                 */
            uint32_t               : 4;
            __IM uint32_t TXIBERR  : 1; /*!< [24..24] Tx Internal Bus Error Interrupt Flag                             */
            uint32_t               : 1;
            __IM uint32_t RXFERR   : 1; /*!< [26..26] Receive Fatal Error Interrupt Flag                               */
            __IM uint32_t RXFAIL   : 1; /*!< [27..27] Receive Fail Interrupt Flag                                      */
            __IM uint32_t RXPFAIL  : 1; /*!< [28..28] Receive Packet Data Fail Interrupt Flag                          */
            __IM uint32_t RXCORERR : 1; /*!< [29..29] Receive Correctable Error Interrupt Flag                         */
            __IM uint32_t RXAKE    : 1; /*!< [30..30] Receive Acknowledge and Error Report Packet Interrupt
                                         *   Flag                                                                      */
            uint32_t : 1;
        } SQCH1SR_b;
    };

    union
    {
        __IOM uint32_t SQCH1SCR;       /*!< (@ 0x00000614) Sequence Channel 1 Status Clear Register                   */

        struct
        {
            uint32_t                : 4;
            __IOM uint32_t AACTFIN  : 1; /*!< [4..4] All Actions Finish Interrupt Flag Clear                            */
            uint32_t                : 3;
            __IOM uint32_t ADESFIN  : 1; /*!< [8..8] All-Descriptors Finish Interrupt Flag Clear                        */
            uint32_t                : 7;
            __IOM uint32_t DABORT   : 1; /*!< [16..16] Descriptor Abort Interrupt Flag Clear                            */
            uint32_t                : 2;
            __IOM uint32_t SIZEERR  : 1; /*!< [19..19] Packet Size Error Interrupt Flag Clear                           */
            uint32_t                : 4;
            __IOM uint32_t TXIBERR  : 1; /*!< [24..24] Tx Internal Bus Error Interrupt Flag Clear                       */
            uint32_t                : 1;
            __IOM uint32_t RXFERR   : 1; /*!< [26..26] Receive Fatal Error Interrupt Flag Clear                         */
            __IOM uint32_t RXFAIL   : 1; /*!< [27..27] Receive Fail Interrupt Flag Clear                                */
            __IOM uint32_t RXPFAIL  : 1; /*!< [28..28] Receive Packet Data Fail Interrupt Flag Clear                    */
            __IOM uint32_t RXCORERR : 1; /*!< [29..29] Receive Correctable Error Interrupt Flag Clear                   */
            __IOM uint32_t RXAKE    : 1; /*!< [30..30] Receive Acknowledge and Error Report Packet Interrupt
                                          *   Flag Clear                                                                */
            uint32_t : 1;
        } SQCH1SCR_b;
    };

    union
    {
        __IOM uint32_t SQCH1IER;       /*!< (@ 0x00000618) Sequence Channel 1 Interrupt Enable Register               */

        struct
        {
            uint32_t                : 4;
            __IOM uint32_t AACTFIN  : 1; /*!< [4..4] All Actions Finish Interrupt Enable                                */
            uint32_t                : 3;
            __IOM uint32_t ADESFIN  : 1; /*!< [8..8] All-Descriptors Finish Interrupt Enable                            */
            uint32_t                : 7;
            __IOM uint32_t DABORT   : 1; /*!< [16..16] Descriptor Abort Interrupt Enable                                */
            uint32_t                : 2;
            __IOM uint32_t SIZEERR  : 1; /*!< [19..19] Packet Size Error Interrupt Enable                               */
            uint32_t                : 4;
            __IOM uint32_t TXIBERR  : 1; /*!< [24..24] Tx Internal Bus Error Interrupt Enable                           */
            uint32_t                : 1;
            __IOM uint32_t RXFERR   : 1; /*!< [26..26] Receive Fatal Error Interrupt Enable                             */
            __IOM uint32_t RXFAIL   : 1; /*!< [27..27] Receive Fail Interrupt Enable                                    */
            __IOM uint32_t RXPFAIL  : 1; /*!< [28..28] Receive Packet Data Fail Interrupt Enable                        */
            __IOM uint32_t RXCORERR : 1; /*!< [29..29] Receive Correctable Error Interrupt Enable                       */
            __IOM uint32_t RXAKE    : 1; /*!< [30..30] Receive Acknowledge and Error Report Packet Interrupt
                                          *   Enable                                                                    */
            uint32_t : 1;
        } SQCH1IER_b;
    };
    __IM uint32_t RESERVED21[89];

    union
    {
        union
        {
            __IOM uint32_t SQCH0DSC0AR;   /*!< (@ 0x00000780) Sequence Channel 0 Descriptor-0 A Register                 */

            struct
            {
                __IOM uint32_t DATA0 : 8; /*!< [7..0] Data 0                                                             */
                __IOM uint32_t DATA1 : 8; /*!< [15..8] Data 1                                                            */
                __IOM uint32_t DT    : 6; /*!< [21..16] Data Type                                                        */
                __IOM uint32_t VC    : 2; /*!< [23..22] Virtual Channel                                                  */
                __IOM uint32_t FMT   : 1; /*!< [24..24] Format                                                           */
                __IOM uint32_t SPD   : 1; /*!< [25..25] Speed                                                            */
                __IOM uint32_t BTA   : 2; /*!< [27..26] Bus Turn Around                                                  */
                __IOM uint32_t NXACT : 2; /*!< [29..28] Next Action                                                      */
                uint32_t             : 2;
            } SQCH0DSC0AR_b;
        };

        struct
        {
            union
            {
                union
                {
                    __IOM uint16_t SQCH0DSC0AR_L; /*!< (@ 0x00000780) Sequence Channel 0 Descriptor-0 A Register                 */

                    struct
                    {
                        __IOM uint16_t DATA0 : 8; /*!< [7..0] Data 0                                                             */
                        __IOM uint16_t DATA1 : 8; /*!< [15..8] Data 1                                                            */
                    } SQCH0DSC0AR_L_b;
                };

                struct
                {
                    union
                    {
                        __IOM uint8_t SQCH0DSC0AR_LL; /*!< (@ 0x00000780) Sequence Channel 0 Descriptor-0 A Register                 */

                        struct
                        {
                            __IOM uint8_t DATA0 : 8;  /*!< [7..0] Data 0                                                             */
                        } SQCH0DSC0AR_LL_b;
                    };

                    union
                    {
                        __IOM uint8_t SQCH0DSC0AR_LH; /*!< (@ 0x00000781) Sequence Channel 0 Descriptor-0 A Register                 */

                        struct
                        {
                            __IOM uint8_t DATA1 : 8;  /*!< [7..0] Data 1                                                             */
                        } SQCH0DSC0AR_LH_b;
                    };
                };
            };

            union
            {
                union
                {
                    __IOM uint16_t SQCH0DSC0AR_H; /*!< (@ 0x00000782) Sequence Channel 0 Descriptor-0 A Register                 */

                    struct
                    {
                        __IOM uint16_t DT    : 6; /*!< [5..0] Data Type                                                          */
                        __IOM uint16_t VC    : 2; /*!< [7..6] Virtual Channel                                                    */
                        __IOM uint16_t FMT   : 1; /*!< [8..8] Format                                                             */
                        __IOM uint16_t SPD   : 1; /*!< [9..9] Speed                                                              */
                        __IOM uint16_t BTA   : 2; /*!< [11..10] Bus Turn Around                                                  */
                        __IOM uint16_t NXACT : 2; /*!< [13..12] Next Action                                                      */
                        uint16_t             : 2;
                    } SQCH0DSC0AR_H_b;
                };

                struct
                {
                    union
                    {
                        __IOM uint8_t SQCH0DSC0AR_HL; /*!< (@ 0x00000782) Sequence Channel 0 Descriptor-0 A Register                 */

                        struct
                        {
                            __IOM uint8_t DT : 6;     /*!< [5..0] Data Type                                                          */
                            __IOM uint8_t VC : 2;     /*!< [7..6] Virtual Channel                                                    */
                        } SQCH0DSC0AR_HL_b;
                    };

                    union
                    {
                        __IOM uint8_t SQCH0DSC0AR_HH; /*!< (@ 0x00000783) Sequence Channel 0 Descriptor-0 A Register                 */

                        struct
                        {
                            __IOM uint8_t FMT   : 1;  /*!< [0..0] Format                                                             */
                            __IOM uint8_t SPD   : 1;  /*!< [1..1] Speed                                                              */
                            __IOM uint8_t BTA   : 2;  /*!< [3..2] Bus Turn Around                                                    */
                            __IOM uint8_t NXACT : 2;  /*!< [5..4] Next Action                                                        */
                            uint8_t             : 2;
                        } SQCH0DSC0AR_HH_b;
                    };
                };
            };
        };
    };

    union
    {
        __IOM uint32_t SQCH0DSC0BR;    /*!< (@ 0x00000784) Sequence Channel 0 Descriptor-0 B Register                 */

        struct
        {
            uint32_t             : 24;
            __IOM uint32_t DTSEL : 2;  /*!< [25..24] Data Select                                                      */
            uint32_t             : 6;
        } SQCH0DSC0BR_b;
    };

    union
    {
        union
        {
            __IOM uint32_t SQCH0DSC0CR;     /*!< (@ 0x00000788) Sequence Channel 0 Descriptor-0 C Register                 */

            struct
            {
                __IOM uint32_t FINACT  : 1; /*!< [0..0] Finish Action                                                      */
                uint32_t               : 21;
                __IOM uint32_t AUXOP   : 1; /*!< [22..22] Auxiliary Operation                                              */
                uint32_t               : 1;
                __IOM uint32_t ACTCODE : 8; /*!< [31..24] Action Code                                                      */
            } SQCH0DSC0CR_b;
        };

        struct
        {
            union
            {
                union
                {
                    __IOM uint16_t SQCH0DSC0CR_L;  /*!< (@ 0x00000788) Sequence Channel 0 Descriptor-0 C Register                 */

                    struct
                    {
                        __IOM uint16_t FINACT : 1; /*!< [0..0] Finish Action                                                      */
                        uint16_t              : 15;
                    } SQCH0DSC0CR_L_b;
                };

                union
                {
                    __IOM uint8_t SQCH0DSC0CR_LL; /*!< (@ 0x00000788) Sequence Channel 0 Descriptor-0 C Register                 */

                    struct
                    {
                        __IOM uint8_t FINACT : 1; /*!< [0..0] Finish Action                                                      */
                        uint8_t              : 7;
                    } SQCH0DSC0CR_LL_b;
                };
            };

            union
            {
                union
                {
                    __IOM uint16_t SQCH0DSC0CR_H; /*!< (@ 0x0000078A) Sequence Channel 0 Descriptor-0 C Register                 */

                    struct
                    {
                        uint16_t               : 6;
                        __IOM uint16_t AUXOP   : 1; /*!< [6..6] Auxiliary Operation                                                */
                        uint16_t               : 1;
                        __IOM uint16_t ACTCODE : 8; /*!< [15..8] Action Code                                                       */
                    } SQCH0DSC0CR_H_b;
                };

                struct
                {
                    union
                    {
                        __IOM uint8_t SQCH0DSC0CR_HL; /*!< (@ 0x0000078A) Sequence Channel 0 Descriptor-0 C Register                 */

                        struct
                        {
                            uint8_t             : 6;
                            __IOM uint8_t AUXOP : 1; /*!< [6..6] Auxiliary Operation                                                */
                            uint8_t             : 1;
                        } SQCH0DSC0CR_HL_b;
                    };

                    union
                    {
                        __IOM uint8_t SQCH0DSC0CR_HH;  /*!< (@ 0x0000078B) Sequence Channel 0 Descriptor-0 C Register                 */

                        struct
                        {
                            __IOM uint8_t ACTCODE : 8; /*!< [7..0] Action Code                                                        */
                        } SQCH0DSC0CR_HH_b;
                    };
                };
            };
        };
    };

    union
    {
        union
        {
            __IOM uint32_t SQCH0DSC0DR;    /*!< (@ 0x0000078C) Sequence Channel 0 Descriptor-0 D Register                 */

            struct
            {
                __IOM uint32_t LADDR : 32; /*!< [31..0] Lower Address                                                     */
            } SQCH0DSC0DR_b;
        };

        struct
        {
            union
            {
                union
                {
                    __IOM uint16_t SQCH0DSC0DR_L;  /*!< (@ 0x0000078C) Sequence Channel 0 Descriptor-0 D Register                 */

                    struct
                    {
                        __IOM uint16_t LADDR : 16; /*!< [15..0] Lower Address                                                     */
                    } SQCH0DSC0DR_L_b;
                };

                struct
                {
                    union
                    {
                        __IOM uint8_t SQCH0DSC0DR_LL; /*!< (@ 0x0000078C) Sequence Channel 0 Descriptor-0 D Register                 */

                        struct
                        {
                            __IOM uint8_t LADDR : 8;  /*!< [7..0] Lower Address                                                      */
                        } SQCH0DSC0DR_LL_b;
                    };

