MikroElektronika/core_packages/ARM/gcc_clang/def/renesas/R7FA8D1BHDCBD/mcu.h
            struct
            {
                __IOM uint32_t FINACT  : 1; /*!< [0..0] Finish Action                                                      */
                uint32_t               : 21;
                __IOM uint32_t AUXOP   : 1; /*!< [22..22] Auxiliary Operation                                              */
                uint32_t               : 1;
                __IOM uint32_t ACTCODE : 8; /*!< [31..24] Action Code                                                      */
            } SQCH0DSC6CR_b;
        };

        struct
        {
            union
            {
                union
                {
                    __IOM uint16_t SQCH0DSC6CR_L;  /*!< (@ 0x000007E8) Sequence Channel 0 Descriptor-6 C Register                 */

                    struct
                    {
                        __IOM uint16_t FINACT : 1; /*!< [0..0] Finish Action                                                      */
                        uint16_t              : 15;
                    } SQCH0DSC6CR_L_b;
                };

                union
                {
                    __IOM uint8_t SQCH0DSC6CR_LL; /*!< (@ 0x000007E8) Sequence Channel 0 Descriptor-6 C Register                 */

                    struct
                    {
                        __IOM uint8_t FINACT : 1; /*!< [0..0] Finish Action                                                      */
                        uint8_t              : 7;
                    } SQCH0DSC6CR_LL_b;
                };
            };

            union
            {
                union
                {
                    __IOM uint16_t SQCH0DSC6CR_H; /*!< (@ 0x000007EA) Sequence Channel 0 Descriptor-6 C Register                 */

                    struct
                    {
                        uint16_t               : 6;
                        __IOM uint16_t AUXOP   : 1; /*!< [6..6] Auxiliary Operation                                                */
                        uint16_t               : 1;
                        __IOM uint16_t ACTCODE : 8; /*!< [15..8] Action Code                                                       */
                    } SQCH0DSC6CR_H_b;
                };

                struct
                {
                    union
                    {
                        __IOM uint8_t SQCH0DSC6CR_HL; /*!< (@ 0x000007EA) Sequence Channel 0 Descriptor-6 C Register                 */

                        struct
                        {
                            uint8_t             : 6;
                            __IOM uint8_t AUXOP : 1; /*!< [6..6] Auxiliary Operation                                                */
                            uint8_t             : 1;
                        } SQCH0DSC6CR_HL_b;
                    };

                    union
                    {
                        __IOM uint8_t SQCH0DSC6CR_HH;  /*!< (@ 0x000007EB) Sequence Channel 0 Descriptor-6 C Register                 */

                        struct
                        {
                            __IOM uint8_t ACTCODE : 8; /*!< [7..0] Action Code                                                        */
                        } SQCH0DSC6CR_HH_b;
                    };
                };
            };
        };
    };

    union
    {
        union
        {
            __IOM uint32_t SQCH0DSC6DR;    /*!< (@ 0x000007EC) Sequence Channel 0 Descriptor-6 D Register                 */

            struct
            {
                __IOM uint32_t LADDR : 32; /*!< [31..0] Lower Address                                                     */
            } SQCH0DSC6DR_b;
        };

        struct
        {
            union
            {
                union
                {
                    __IOM uint16_t SQCH0DSC6DR_L;  /*!< (@ 0x000007EC) Sequence Channel 0 Descriptor-6 D Register                 */

                    struct
                    {
                        __IOM uint16_t LADDR : 16; /*!< [15..0] Lower Address                                                     */
                    } SQCH0DSC6DR_L_b;
                };

                struct
                {
                    union
                    {
                        __IOM uint8_t SQCH0DSC6DR_LL; /*!< (@ 0x000007EC) Sequence Channel 0 Descriptor-6 D Register                 */

                        struct
                        {
                            __IOM uint8_t LADDR : 8;  /*!< [7..0] Lower Address                                                      */
                        } SQCH0DSC6DR_LL_b;
                    };

                    union
                    {
                        __IOM uint8_t SQCH0DSC6DR_LH; /*!< (@ 0x000007ED) Sequence Channel 0 Descriptor-6 D Register                 */

                        struct
                        {
                            __IOM uint8_t LADDR : 8;  /*!< [7..0] Lower Address                                                      */
                        } SQCH0DSC6DR_LH_b;
                    };
                };
            };

            union
            {
                union
                {
                    __IOM uint16_t SQCH0DSC6DR_H;  /*!< (@ 0x000007EE) Sequence Channel 0 Descriptor-6 D Register                 */

                    struct
                    {
                        __IOM uint16_t LADDR : 16; /*!< [15..0] Lower Address                                                     */
                    } SQCH0DSC6DR_H_b;
                };

                struct
                {
                    union
                    {
                        __IOM uint8_t SQCH0DSC6DR_HL; /*!< (@ 0x000007EE) Sequence Channel 0 Descriptor-6 D Register                 */

                        struct
                        {
                            __IOM uint8_t LADDR : 8;  /*!< [7..0] Lower Address                                                      */
                        } SQCH0DSC6DR_HL_b;
                    };

                    union
                    {
                        __IOM uint8_t SQCH0DSC6DR_HH; /*!< (@ 0x000007EF) Sequence Channel 0 Descriptor-6 D Register                 */

                        struct
                        {
                            __IOM uint8_t LADDR : 8;  /*!< [7..0] Lower Address                                                      */
                        } SQCH0DSC6DR_HH_b;
                    };
                };
            };
        };
    };

    union
    {
        union
        {
            __IOM uint32_t SQCH0DSC7AR;   /*!< (@ 0x000007F0) Sequence Channel 0 Descriptor-7 A Register                 */

            struct
            {
                __IOM uint32_t DATA0 : 8; /*!< [7..0] Data 0                                                             */
                __IOM uint32_t DATA1 : 8; /*!< [15..8] Data 1                                                            */
                __IOM uint32_t DT    : 6; /*!< [21..16] Data Type                                                        */
                __IOM uint32_t VC    : 2; /*!< [23..22] Virtual Channel                                                  */
                __IOM uint32_t FMT   : 1; /*!< [24..24] Format                                                           */
                __IOM uint32_t SPD   : 1; /*!< [25..25] Speed                                                            */
                __IOM uint32_t BTA   : 2; /*!< [27..26] Bus Turn Around                                                  */
                __IOM uint32_t NXACT : 2; /*!< [29..28] Next Action                                                      */
                uint32_t             : 2;
            } SQCH0DSC7AR_b;
        };

        struct
        {
            union
            {
                union
                {
                    __IOM uint16_t SQCH0DSC7AR_L; /*!< (@ 0x000007F0) Sequence Channel 0 Descriptor-7 A Register                 */

                    struct
                    {
                        __IOM uint16_t DATA0 : 8; /*!< [7..0] Data 0                                                             */
                        __IOM uint16_t DATA1 : 8; /*!< [15..8] Data 1                                                            */
                    } SQCH0DSC7AR_L_b;
                };

                struct
                {
                    union
                    {
                        __IOM uint8_t SQCH0DSC7AR_LL; /*!< (@ 0x000007F0) Sequence Channel 0 Descriptor-7 A Register                 */

                        struct
                        {
                            __IOM uint8_t DATA0 : 8;  /*!< [7..0] Data 0                                                             */
                        } SQCH0DSC7AR_LL_b;
                    };

                    union
                    {
                        __IOM uint8_t SQCH0DSC7AR_LH; /*!< (@ 0x000007F1) Sequence Channel 0 Descriptor-7 A Register                 */

                        struct
                        {
                            __IOM uint8_t DATA1 : 8;  /*!< [7..0] Data 1                                                             */
                        } SQCH0DSC7AR_LH_b;
                    };
                };
            };

            union
            {
                union
                {
                    __IOM uint16_t SQCH0DSC7AR_H; /*!< (@ 0x000007F2) Sequence Channel 0 Descriptor-7 A Register                 */

                    struct
                    {
                        __IOM uint16_t DT    : 6; /*!< [5..0] Data Type                                                          */
                        __IOM uint16_t VC    : 2; /*!< [7..6] Virtual Channel                                                    */
                        __IOM uint16_t FMT   : 1; /*!< [8..8] Format                                                             */
                        __IOM uint16_t SPD   : 1; /*!< [9..9] Speed                                                              */
                        __IOM uint16_t BTA   : 2; /*!< [11..10] Bus Turn Around                                                  */
                        __IOM uint16_t NXACT : 2; /*!< [13..12] Next Action                                                      */
                        uint16_t             : 2;
                    } SQCH0DSC7AR_H_b;
                };

                struct
                {
                    union
                    {
                        __IOM uint8_t SQCH0DSC7AR_HL; /*!< (@ 0x000007F2) Sequence Channel 0 Descriptor-7 A Register                 */

                        struct
                        {
                            __IOM uint8_t DT : 6;     /*!< [5..0] Data Type                                                          */
                            __IOM uint8_t VC : 2;     /*!< [7..6] Virtual Channel                                                    */
                        } SQCH0DSC7AR_HL_b;
                    };

                    union
                    {
                        __IOM uint8_t SQCH0DSC7AR_HH; /*!< (@ 0x000007F3) Sequence Channel 0 Descriptor-7 A Register                 */

                        struct
                        {
                            __IOM uint8_t FMT   : 1;  /*!< [0..0] Format                                                             */
                            __IOM uint8_t SPD   : 1;  /*!< [1..1] Speed                                                              */
                            __IOM uint8_t BTA   : 2;  /*!< [3..2] Bus Turn Around                                                    */
                            __IOM uint8_t NXACT : 2;  /*!< [5..4] Next Action                                                        */
                            uint8_t             : 2;
                        } SQCH0DSC7AR_HH_b;
                    };
                };
            };
        };
    };

    union
    {
        __IOM uint32_t SQCH0DSC7BR;    /*!< (@ 0x000007F4) Sequence Channel 0 Descriptor-7 B Register                 */

        struct
        {
            uint32_t             : 24;
            __IOM uint32_t DTSEL : 2;  /*!< [25..24] Data Select                                                      */
            uint32_t             : 6;
        } SQCH0DSC7BR_b;
    };

    union
    {
        union
        {
            __IOM uint32_t SQCH0DSC7CR;     /*!< (@ 0x000007F8) Sequence Channel 0 Descriptor-7 C Register                 */

            struct
            {
                __IOM uint32_t FINACT  : 1; /*!< [0..0] Finish Action                                                      */
                uint32_t               : 21;
                __IOM uint32_t AUXOP   : 1; /*!< [22..22] Auxiliary Operation                                              */
                uint32_t               : 1;
                __IOM uint32_t ACTCODE : 8; /*!< [31..24] Action Code                                                      */
            } SQCH0DSC7CR_b;
        };

        struct
        {
            union
            {
                union
                {
                    __IOM uint16_t SQCH0DSC7CR_L;  /*!< (@ 0x000007F8) Sequence Channel 0 Descriptor-7 C Register                 */

                    struct
                    {
                        __IOM uint16_t FINACT : 1; /*!< [0..0] Finish Action                                                      */
                        uint16_t              : 15;
                    } SQCH0DSC7CR_L_b;
                };

                union
                {
                    __IOM uint8_t SQCH0DSC7CR_LL; /*!< (@ 0x000007F8) Sequence Channel 0 Descriptor-7 C Register                 */

                    struct
                    {
                        __IOM uint8_t FINACT : 1; /*!< [0..0] Finish Action                                                      */
                        uint8_t              : 7;
                    } SQCH0DSC7CR_LL_b;
                };
            };

            union
            {
                union
                {
                    __IOM uint16_t SQCH0DSC7CR_H; /*!< (@ 0x000007FA) Sequence Channel 0 Descriptor-7 C Register                 */

                    struct
                    {
                        uint16_t               : 6;
                        __IOM uint16_t AUXOP   : 1; /*!< [6..6] Auxiliary Operation                                                */
                        uint16_t               : 1;
                        __IOM uint16_t ACTCODE : 8; /*!< [15..8] Action Code                                                       */
                    } SQCH0DSC7CR_H_b;
                };

                struct
                {
                    union
                    {
                        __IOM uint8_t SQCH0DSC7CR_HL; /*!< (@ 0x000007FA) Sequence Channel 0 Descriptor-7 C Register                 */

                        struct
                        {
                            uint8_t             : 6;
                            __IOM uint8_t AUXOP : 1; /*!< [6..6] Auxiliary Operation                                                */
                            uint8_t             : 1;
                        } SQCH0DSC7CR_HL_b;
                    };

                    union
                    {
                        __IOM uint8_t SQCH0DSC7CR_HH;  /*!< (@ 0x000007FB) Sequence Channel 0 Descriptor-7 C Register                 */

                        struct
                        {
                            __IOM uint8_t ACTCODE : 8; /*!< [7..0] Action Code                                                        */
                        } SQCH0DSC7CR_HH_b;
                    };
                };
            };
        };
    };

    union
    {
        union
        {
            __IOM uint32_t SQCH0DSC7DR;    /*!< (@ 0x000007FC) Sequence Channel 0 Descriptor-7 D Register                 */

            struct
            {
                __IOM uint32_t LADDR : 32; /*!< [31..0] Lower Address                                                     */
            } SQCH0DSC7DR_b;
        };

        struct
        {
            union
            {
                union
                {
                    __IOM uint16_t SQCH0DSC7DR_L;  /*!< (@ 0x000007FC) Sequence Channel 0 Descriptor-7 D Register                 */

                    struct
                    {
                        __IOM uint16_t LADDR : 16; /*!< [15..0] Lower Address                                                     */
                    } SQCH0DSC7DR_L_b;
                };

                struct
                {
                    union
                    {
                        __IOM uint8_t SQCH0DSC7DR_LL; /*!< (@ 0x000007FC) Sequence Channel 0 Descriptor-7 D Register                 */

                        struct
                        {
                            __IOM uint8_t LADDR : 8;  /*!< [7..0] Lower Address                                                      */
                        } SQCH0DSC7DR_LL_b;
                    };

                    union
                    {
                        __IOM uint8_t SQCH0DSC7DR_LH; /*!< (@ 0x000007FD) Sequence Channel 0 Descriptor-7 D Register                 */

                        struct
                        {
                            __IOM uint8_t LADDR : 8;  /*!< [7..0] Lower Address                                                      */
                        } SQCH0DSC7DR_LH_b;
                    };
                };
            };

            union
            {
                union
                {
                    __IOM uint16_t SQCH0DSC7DR_H;  /*!< (@ 0x000007FE) Sequence Channel 0 Descriptor-7 D Register                 */

                    struct
                    {
                        __IOM uint16_t LADDR : 16; /*!< [15..0] Lower Address                                                     */
                    } SQCH0DSC7DR_H_b;
                };

                struct
                {
                    union
                    {
                        __IOM uint8_t SQCH0DSC7DR_HL; /*!< (@ 0x000007FE) Sequence Channel 0 Descriptor-7 D Register                 */

                        struct
                        {
                            __IOM uint8_t LADDR : 8;  /*!< [7..0] Lower Address                                                      */
                        } SQCH0DSC7DR_HL_b;
                    };

                    union
                    {
                        __IOM uint8_t SQCH0DSC7DR_HH; /*!< (@ 0x000007FF) Sequence Channel 0 Descriptor-7 D Register                 */

                        struct
                        {
                            __IOM uint8_t LADDR : 8;  /*!< [7..0] Lower Address                                                      */
                        } SQCH0DSC7DR_HH_b;
                    };
                };
            };
        };
    };

    union
    {
        union
        {
            __IOM uint32_t SQCH1DSC0AR;   /*!< (@ 0x00000800) Sequence Channel 1 Descriptor-0 A Register                 */

            struct
            {
                __IOM uint32_t DATA0 : 8; /*!< [7..0] Data 0                                                             */
                __IOM uint32_t DATA1 : 8; /*!< [15..8] Data 1                                                            */
                __IOM uint32_t DT    : 6; /*!< [21..16] Data Type                                                        */
                __IOM uint32_t VC    : 2; /*!< [23..22] Virtual Channel                                                  */
                __IOM uint32_t FMT   : 1; /*!< [24..24] Format                                                           */
                __IOM uint32_t SPD   : 1; /*!< [25..25] Speed                                                            */
                __IOM uint32_t BTA   : 2; /*!< [27..26] Bus Turn Around                                                  */
                __IOM uint32_t NXACT : 2; /*!< [29..28] Next Action                                                      */
                uint32_t             : 2;
            } SQCH1DSC0AR_b;
        };

        struct
        {
            union
            {
                union
                {
                    __IOM uint16_t SQCH1DSC0AR_L; /*!< (@ 0x00000800) Sequence Channel 1 Descriptor-0 A Register                 */

                    struct
                    {
                        __IOM uint16_t DATA0 : 8; /*!< [7..0] Data 0                                                             */
                        __IOM uint16_t DATA1 : 8; /*!< [15..8] Data 1                                                            */
                    } SQCH1DSC0AR_L_b;
                };

                struct
                {
                    union
                    {
                        __IOM uint8_t SQCH1DSC0AR_LL; /*!< (@ 0x00000800) Sequence Channel 1 Descriptor-0 A Register                 */

                        struct
                        {
                            __IOM uint8_t DATA0 : 8;  /*!< [7..0] Data 0                                                             */
                        } SQCH1DSC0AR_LL_b;
                    };

                    union
                    {
                        __IOM uint8_t SQCH1DSC0AR_LH; /*!< (@ 0x00000801) Sequence Channel 1 Descriptor-0 A Register                 */

                        struct
                        {
                            __IOM uint8_t DATA1 : 8;  /*!< [7..0] Data 1                                                             */
                        } SQCH1DSC0AR_LH_b;
                    };
                };
            };

            union
            {
                union
                {
                    __IOM uint16_t SQCH1DSC0AR_H; /*!< (@ 0x00000802) Sequence Channel 1 Descriptor-0 A Register                 */

                    struct
                    {
                        __IOM uint16_t DT    : 6; /*!< [5..0] Data Type                                                          */
                        __IOM uint16_t VC    : 2; /*!< [7..6] Virtual Channel                                                    */
                        __IOM uint16_t FMT   : 1; /*!< [8..8] Format                                                             */
                        __IOM uint16_t SPD   : 1; /*!< [9..9] Speed                                                              */
                        __IOM uint16_t BTA   : 2; /*!< [11..10] Bus Turn Around                                                  */
                        __IOM uint16_t NXACT : 2; /*!< [13..12] Next Action                                                      */
                        uint16_t             : 2;
                    } SQCH1DSC0AR_H_b;
                };

                struct
                {
                    union
                    {
                        __IOM uint8_t SQCH1DSC0AR_HL; /*!< (@ 0x00000802) Sequence Channel 1 Descriptor-0 A Register                 */

                        struct
                        {
                            __IOM uint8_t DT : 6;     /*!< [5..0] Data Type                                                          */
                            __IOM uint8_t VC : 2;     /*!< [7..6] Virtual Channel                                                    */
                        } SQCH1DSC0AR_HL_b;
                    };

