MikroElektronika/core_packages/ARM/gcc_clang/def/renesas/R7FA8D1BHDCBD/mcu.h
 #define R_XSPI0_INTE_PATCMPE_Pos          (1UL)          /*!< PATCMPE (Bit 1)                                       */
 #define R_XSPI0_INTE_PATCMPE_Msk          (0x2UL)        /*!< PATCMPE (Bitfield-Mask: 0x01)                         */
 #define R_XSPI0_INTE_INICMPE_Pos          (2UL)          /*!< INICMPE (Bit 2)                                       */
 #define R_XSPI0_INTE_INICMPE_Msk          (0x4UL)        /*!< INICMPE (Bitfield-Mask: 0x01)                         */
 #define R_XSPI0_INTE_PERTOE_Pos           (3UL)          /*!< PERTOE (Bit 3)                                        */
 #define R_XSPI0_INTE_PERTOE_Msk           (0x8UL)        /*!< PERTOE (Bitfield-Mask: 0x01)                          */
 #define R_XSPI0_INTE_DSTOCSE_Pos          (4UL)          /*!< DSTOCSE (Bit 4)                                       */
 #define R_XSPI0_INTE_DSTOCSE_Msk          (0x10UL)       /*!< DSTOCSE (Bitfield-Mask: 0x01)                         */
 #define R_XSPI0_INTE_ECSCSE_Pos           (8UL)          /*!< ECSCSE (Bit 8)                                        */
 #define R_XSPI0_INTE_ECSCSE_Msk           (0x100UL)      /*!< ECSCSE (Bitfield-Mask: 0x01)                          */
 #define R_XSPI0_INTE_INTCSE_Pos           (12UL)         /*!< INTCSE (Bit 12)                                       */
 #define R_XSPI0_INTE_INTCSE_Msk           (0x1000UL)     /*!< INTCSE (Bitfield-Mask: 0x01)                          */
 #define R_XSPI0_INTE_BRGOFCHE_Pos         (16UL)         /*!< BRGOFCHE (Bit 16)                                     */
 #define R_XSPI0_INTE_BRGOFCHE_Msk         (0x10000UL)    /*!< BRGOFCHE (Bitfield-Mask: 0x01)                        */
 #define R_XSPI0_INTE_BRGUFCHE_Pos         (18UL)         /*!< BRGUFCHE (Bit 18)                                     */
 #define R_XSPI0_INTE_BRGUFCHE_Msk         (0x40000UL)    /*!< BRGUFCHE (Bitfield-Mask: 0x01)                        */
 #define R_XSPI0_INTE_BUSERRCHE_Pos        (20UL)         /*!< BUSERRCHE (Bit 20)                                    */
 #define R_XSPI0_INTE_BUSERRCHE_Msk        (0x100000UL)   /*!< BUSERRCHE (Bitfield-Mask: 0x01)                       */
 #define R_XSPI0_INTE_CAFAILCSE_Pos        (28UL)         /*!< CAFAILCSE (Bit 28)                                    */
 #define R_XSPI0_INTE_CAFAILCSE_Msk        (0x10000000UL) /*!< CAFAILCSE (Bitfield-Mask: 0x01)                       */
 #define R_XSPI0_INTE_CASUCCSE_Pos         (30UL)         /*!< CASUCCSE (Bit 30)                                     */
 #define R_XSPI0_INTE_CASUCCSE_Msk         (0x40000000UL) /*!< CASUCCSE (Bitfield-Mask: 0x01)                        */

/* =========================================================================================================================== */
/* ================                                        R_MIPI_PHY                                         ================ */
/* =========================================================================================================================== */

/* =======================================================  DPHYREFCR  ======================================================= */
 #define R_MIPI_PHY_DPHYREFCR_RFREQ_Pos      (0UL)          /*!< RFREQ (Bit 0)                                         */
 #define R_MIPI_PHY_DPHYREFCR_RFREQ_Msk      (0xffUL)       /*!< RFREQ (Bitfield-Mask: 0xff)                           */
/* =======================================================  DPHYPLFCR  ======================================================= */
 #define R_MIPI_PHY_DPHYPLFCR_IDIV_Pos       (0UL)          /*!< IDIV (Bit 0)                                          */
 #define R_MIPI_PHY_DPHYPLFCR_IDIV_Msk       (0x3UL)        /*!< IDIV (Bitfield-Mask: 0x03)                            */
 #define R_MIPI_PHY_DPHYPLFCR_NFMUL_Pos      (8UL)          /*!< NFMUL (Bit 8)                                         */
 #define R_MIPI_PHY_DPHYPLFCR_NFMUL_Msk      (0x300UL)      /*!< NFMUL (Bitfield-Mask: 0x03)                           */
 #define R_MIPI_PHY_DPHYPLFCR_PMUL_Pos       (12UL)         /*!< PMUL (Bit 12)                                         */
 #define R_MIPI_PHY_DPHYPLFCR_PMUL_Msk       (0x3000UL)     /*!< PMUL (Bitfield-Mask: 0x03)                            */
 #define R_MIPI_PHY_DPHYPLFCR_NMUL_Pos       (16UL)         /*!< NMUL (Bit 16)                                         */
 #define R_MIPI_PHY_DPHYPLFCR_NMUL_Msk       (0x1ff0000UL)  /*!< NMUL (Bitfield-Mask: 0x1ff)                           */
/* =======================================================  DPHYPLOCR  ======================================================= */
 #define R_MIPI_PHY_DPHYPLOCR_PLLSTP_Pos     (0UL)          /*!< PLLSTP (Bit 0)                                        */
 #define R_MIPI_PHY_DPHYPLOCR_PLLSTP_Msk     (0x1UL)        /*!< PLLSTP (Bitfield-Mask: 0x01)                          */
/* =======================================================  DPHYESCCR  ======================================================= */
 #define R_MIPI_PHY_DPHYESCCR_ESCDIV_Pos     (0UL)          /*!< ESCDIV (Bit 0)                                        */
 #define R_MIPI_PHY_DPHYESCCR_ESCDIV_Msk     (0x1fUL)       /*!< ESCDIV (Bitfield-Mask: 0x1f)                          */
/* =======================================================  DPHYPWRCR  ======================================================= */
 #define R_MIPI_PHY_DPHYPWRCR_PWRSEN_Pos     (0UL)          /*!< PWRSEN (Bit 0)                                        */
 #define R_MIPI_PHY_DPHYPWRCR_PWRSEN_Msk     (0x1UL)        /*!< PWRSEN (Bitfield-Mask: 0x01)                          */
/* ========================================================  DPHYSFR  ======================================================== */
 #define R_MIPI_PHY_DPHYSFR_PWRSF_Pos        (0UL)          /*!< PWRSF (Bit 0)                                         */
 #define R_MIPI_PHY_DPHYSFR_PWRSF_Msk        (0x1UL)        /*!< PWRSF (Bitfield-Mask: 0x01)                           */
 #define R_MIPI_PHY_DPHYSFR_PLLSF_Pos        (8UL)          /*!< PLLSF (Bit 8)                                         */
 #define R_MIPI_PHY_DPHYSFR_PLLSF_Msk        (0x100UL)      /*!< PLLSF (Bitfield-Mask: 0x01)                           */
/* ========================================================  DPHYOCR  ======================================================== */
 #define R_MIPI_PHY_DPHYOCR_DPHYEN_Pos       (0UL)          /*!< DPHYEN (Bit 0)                                        */
 #define R_MIPI_PHY_DPHYOCR_DPHYEN_Msk       (0x1UL)        /*!< DPHYEN (Bitfield-Mask: 0x01)                          */
/* =======================================================  DPHYTIM1  ======================================================== */
 #define R_MIPI_PHY_DPHYTIM1_TINIT_Pos       (0UL)          /*!< TINIT (Bit 0)                                         */
 #define R_MIPI_PHY_DPHYTIM1_TINIT_Msk       (0x7ffffUL)    /*!< TINIT (Bitfield-Mask: 0x7ffff)                        */
/* =======================================================  DPHYTIM2  ======================================================== */
 #define R_MIPI_PHY_DPHYTIM2_TCLKPREP_Pos    (0UL)          /*!< TCLKPREP (Bit 0)                                      */
 #define R_MIPI_PHY_DPHYTIM2_TCLKPREP_Msk    (0xffUL)       /*!< TCLKPREP (Bitfield-Mask: 0xff)                        */
 #define R_MIPI_PHY_DPHYTIM2_TCLKSETT_Pos    (8UL)          /*!< TCLKSETT (Bit 8)                                      */
 #define R_MIPI_PHY_DPHYTIM2_TCLKSETT_Msk    (0xff00UL)     /*!< TCLKSETT (Bitfield-Mask: 0xff)                        */
 #define R_MIPI_PHY_DPHYTIM2_TCLKMISS_Pos    (16UL)         /*!< TCLKMISS (Bit 16)                                     */
 #define R_MIPI_PHY_DPHYTIM2_TCLKMISS_Msk    (0xff0000UL)   /*!< TCLKMISS (Bitfield-Mask: 0xff)                        */
/* =======================================================  DPHYTIM3  ======================================================== */
 #define R_MIPI_PHY_DPHYTIM3_THSPREP_Pos     (0UL)          /*!< THSPREP (Bit 0)                                       */
 #define R_MIPI_PHY_DPHYTIM3_THSPREP_Msk     (0xffUL)       /*!< THSPREP (Bitfield-Mask: 0xff)                         */
 #define R_MIPI_PHY_DPHYTIM3_THSSETT_Pos     (8UL)          /*!< THSSETT (Bit 8)                                       */
 #define R_MIPI_PHY_DPHYTIM3_THSSETT_Msk     (0xff00UL)     /*!< THSSETT (Bitfield-Mask: 0xff)                         */
/* =======================================================  DPHYTIM4  ======================================================== */
 #define R_MIPI_PHY_DPHYTIM4_TCLKZERO_Pos    (0UL)          /*!< TCLKZERO (Bit 0)                                      */
 #define R_MIPI_PHY_DPHYTIM4_TCLKZERO_Msk    (0xffUL)       /*!< TCLKZERO (Bitfield-Mask: 0xff)                        */
 #define R_MIPI_PHY_DPHYTIM4_TCLKPRE_Pos     (8UL)          /*!< TCLKPRE (Bit 8)                                       */
 #define R_MIPI_PHY_DPHYTIM4_TCLKPRE_Msk     (0xff00UL)     /*!< TCLKPRE (Bitfield-Mask: 0xff)                         */
 #define R_MIPI_PHY_DPHYTIM4_TCLKPOST_Pos    (16UL)         /*!< TCLKPOST (Bit 16)                                     */
 #define R_MIPI_PHY_DPHYTIM4_TCLKPOST_Msk    (0xff0000UL)   /*!< TCLKPOST (Bitfield-Mask: 0xff)                        */
 #define R_MIPI_PHY_DPHYTIM4_TCLKTRL_Pos     (24UL)         /*!< TCLKTRL (Bit 24)                                      */
 #define R_MIPI_PHY_DPHYTIM4_TCLKTRL_Msk     (0xff000000UL) /*!< TCLKTRL (Bitfield-Mask: 0xff)                         */
/* =======================================================  DPHYTIM5  ======================================================== */
 #define R_MIPI_PHY_DPHYTIM5_THSZERO_Pos     (0UL)          /*!< THSZERO (Bit 0)                                       */
 #define R_MIPI_PHY_DPHYTIM5_THSZERO_Msk     (0xffUL)       /*!< THSZERO (Bitfield-Mask: 0xff)                         */
 #define R_MIPI_PHY_DPHYTIM5_THSTRL_Pos      (8UL)          /*!< THSTRL (Bit 8)                                        */
 #define R_MIPI_PHY_DPHYTIM5_THSTRL_Msk      (0xff00UL)     /*!< THSTRL (Bitfield-Mask: 0xff)                          */
 #define R_MIPI_PHY_DPHYTIM5_THSEXIT_Pos     (16UL)         /*!< THSEXIT (Bit 16)                                      */
 #define R_MIPI_PHY_DPHYTIM5_THSEXIT_Msk     (0xff0000UL)   /*!< THSEXIT (Bitfield-Mask: 0xff)                         */
/* =======================================================  DPHYTIM6  ======================================================== */
 #define R_MIPI_PHY_DPHYTIM6_TLPX_Pos        (0UL)          /*!< TLPX (Bit 0)                                          */
 #define R_MIPI_PHY_DPHYTIM6_TLPX_Msk        (0xffUL)       /*!< TLPX (Bitfield-Mask: 0xff)                            */
/* ========================================================  DPHYMDC  ======================================================== */
 #define R_MIPI_PHY_DPHYMDC_MASTEREN_Pos     (0UL)          /*!< MASTEREN (Bit 0)                                      */
 #define R_MIPI_PHY_DPHYMDC_MASTEREN_Msk     (0x1UL)        /*!< MASTEREN (Bitfield-Mask: 0x01)                        */

/* =========================================================================================================================== */
/* ================                                           R_CEU                                           ================ */
/* =========================================================================================================================== */

