MikroElektronika/core_packages/ARM/gcc_clang/def/renesas/R7FA8D1BHDCBD/mcu.h
 #define R_MIPI_DSI_SQCH0DSC1AR_H_VC_Pos          (6UL)          /*!< VC (Bit 6)                                            */
 #define R_MIPI_DSI_SQCH0DSC1AR_H_VC_Msk          (0xc0UL)       /*!< VC (Bitfield-Mask: 0x03)                              */
 #define R_MIPI_DSI_SQCH0DSC1AR_H_FMT_Pos         (8UL)          /*!< FMT (Bit 8)                                           */
 #define R_MIPI_DSI_SQCH0DSC1AR_H_FMT_Msk         (0x100UL)      /*!< FMT (Bitfield-Mask: 0x01)                             */
 #define R_MIPI_DSI_SQCH0DSC1AR_H_SPD_Pos         (9UL)          /*!< SPD (Bit 9)                                           */
 #define R_MIPI_DSI_SQCH0DSC1AR_H_SPD_Msk         (0x200UL)      /*!< SPD (Bitfield-Mask: 0x01)                             */
 #define R_MIPI_DSI_SQCH0DSC1AR_H_BTA_Pos         (10UL)         /*!< BTA (Bit 10)                                          */
 #define R_MIPI_DSI_SQCH0DSC1AR_H_BTA_Msk         (0xc00UL)      /*!< BTA (Bitfield-Mask: 0x03)                             */
 #define R_MIPI_DSI_SQCH0DSC1AR_H_NXACT_Pos       (12UL)         /*!< NXACT (Bit 12)                                        */
 #define R_MIPI_DSI_SQCH0DSC1AR_H_NXACT_Msk       (0x3000UL)     /*!< NXACT (Bitfield-Mask: 0x03)                           */
/* =====================================================  SQCH0DSC2AR_H  ===================================================== */
 #define R_MIPI_DSI_SQCH0DSC2AR_H_DT_Pos          (0UL)          /*!< DT (Bit 0)                                            */
 #define R_MIPI_DSI_SQCH0DSC2AR_H_DT_Msk          (0x3fUL)       /*!< DT (Bitfield-Mask: 0x3f)                              */
 #define R_MIPI_DSI_SQCH0DSC2AR_H_VC_Pos          (6UL)          /*!< VC (Bit 6)                                            */
 #define R_MIPI_DSI_SQCH0DSC2AR_H_VC_Msk          (0xc0UL)       /*!< VC (Bitfield-Mask: 0x03)                              */
 #define R_MIPI_DSI_SQCH0DSC2AR_H_FMT_Pos         (8UL)          /*!< FMT (Bit 8)                                           */
 #define R_MIPI_DSI_SQCH0DSC2AR_H_FMT_Msk         (0x100UL)      /*!< FMT (Bitfield-Mask: 0x01)                             */
 #define R_MIPI_DSI_SQCH0DSC2AR_H_SPD_Pos         (9UL)          /*!< SPD (Bit 9)                                           */
 #define R_MIPI_DSI_SQCH0DSC2AR_H_SPD_Msk         (0x200UL)      /*!< SPD (Bitfield-Mask: 0x01)                             */
 #define R_MIPI_DSI_SQCH0DSC2AR_H_BTA_Pos         (10UL)         /*!< BTA (Bit 10)                                          */
 #define R_MIPI_DSI_SQCH0DSC2AR_H_BTA_Msk         (0xc00UL)      /*!< BTA (Bitfield-Mask: 0x03)                             */
 #define R_MIPI_DSI_SQCH0DSC2AR_H_NXACT_Pos       (12UL)         /*!< NXACT (Bit 12)                                        */
 #define R_MIPI_DSI_SQCH0DSC2AR_H_NXACT_Msk       (0x3000UL)     /*!< NXACT (Bitfield-Mask: 0x03)                           */
/* =====================================================  SQCH0DSC3AR_H  ===================================================== */
 #define R_MIPI_DSI_SQCH0DSC3AR_H_DT_Pos          (0UL)          /*!< DT (Bit 0)                                            */
 #define R_MIPI_DSI_SQCH0DSC3AR_H_DT_Msk          (0x3fUL)       /*!< DT (Bitfield-Mask: 0x3f)                              */
 #define R_MIPI_DSI_SQCH0DSC3AR_H_VC_Pos          (6UL)          /*!< VC (Bit 6)                                            */
 #define R_MIPI_DSI_SQCH0DSC3AR_H_VC_Msk          (0xc0UL)       /*!< VC (Bitfield-Mask: 0x03)                              */
 #define R_MIPI_DSI_SQCH0DSC3AR_H_FMT_Pos         (8UL)          /*!< FMT (Bit 8)                                           */
 #define R_MIPI_DSI_SQCH0DSC3AR_H_FMT_Msk         (0x100UL)      /*!< FMT (Bitfield-Mask: 0x01)                             */
 #define R_MIPI_DSI_SQCH0DSC3AR_H_SPD_Pos         (9UL)          /*!< SPD (Bit 9)                                           */
 #define R_MIPI_DSI_SQCH0DSC3AR_H_SPD_Msk         (0x200UL)      /*!< SPD (Bitfield-Mask: 0x01)                             */
 #define R_MIPI_DSI_SQCH0DSC3AR_H_BTA_Pos         (10UL)         /*!< BTA (Bit 10)                                          */
 #define R_MIPI_DSI_SQCH0DSC3AR_H_BTA_Msk         (0xc00UL)      /*!< BTA (Bitfield-Mask: 0x03)                             */
 #define R_MIPI_DSI_SQCH0DSC3AR_H_NXACT_Pos       (12UL)         /*!< NXACT (Bit 12)                                        */
 #define R_MIPI_DSI_SQCH0DSC3AR_H_NXACT_Msk       (0x3000UL)     /*!< NXACT (Bitfield-Mask: 0x03)                           */
/* =====================================================  SQCH0DSC4AR_H  ===================================================== */
 #define R_MIPI_DSI_SQCH0DSC4AR_H_DT_Pos          (0UL)          /*!< DT (Bit 0)                                            */
 #define R_MIPI_DSI_SQCH0DSC4AR_H_DT_Msk          (0x3fUL)       /*!< DT (Bitfield-Mask: 0x3f)                              */
 #define R_MIPI_DSI_SQCH0DSC4AR_H_VC_Pos          (6UL)          /*!< VC (Bit 6)                                            */
 #define R_MIPI_DSI_SQCH0DSC4AR_H_VC_Msk          (0xc0UL)       /*!< VC (Bitfield-Mask: 0x03)                              */
 #define R_MIPI_DSI_SQCH0DSC4AR_H_FMT_Pos         (8UL)          /*!< FMT (Bit 8)                                           */
 #define R_MIPI_DSI_SQCH0DSC4AR_H_FMT_Msk         (0x100UL)      /*!< FMT (Bitfield-Mask: 0x01)                             */
 #define R_MIPI_DSI_SQCH0DSC4AR_H_SPD_Pos         (9UL)          /*!< SPD (Bit 9)                                           */
 #define R_MIPI_DSI_SQCH0DSC4AR_H_SPD_Msk         (0x200UL)      /*!< SPD (Bitfield-Mask: 0x01)                             */
 #define R_MIPI_DSI_SQCH0DSC4AR_H_BTA_Pos         (10UL)         /*!< BTA (Bit 10)                                          */
 #define R_MIPI_DSI_SQCH0DSC4AR_H_BTA_Msk         (0xc00UL)      /*!< BTA (Bitfield-Mask: 0x03)                             */
 #define R_MIPI_DSI_SQCH0DSC4AR_H_NXACT_Pos       (12UL)         /*!< NXACT (Bit 12)                                        */
 #define R_MIPI_DSI_SQCH0DSC4AR_H_NXACT_Msk       (0x3000UL)     /*!< NXACT (Bitfield-Mask: 0x03)                           */
/* =====================================================  SQCH0DSC5AR_H  ===================================================== */
 #define R_MIPI_DSI_SQCH0DSC5AR_H_DT_Pos          (0UL)          /*!< DT (Bit 0)                                            */
 #define R_MIPI_DSI_SQCH0DSC5AR_H_DT_Msk          (0x3fUL)       /*!< DT (Bitfield-Mask: 0x3f)                              */
 #define R_MIPI_DSI_SQCH0DSC5AR_H_VC_Pos          (6UL)          /*!< VC (Bit 6)                                            */
 #define R_MIPI_DSI_SQCH0DSC5AR_H_VC_Msk          (0xc0UL)       /*!< VC (Bitfield-Mask: 0x03)                              */
 #define R_MIPI_DSI_SQCH0DSC5AR_H_FMT_Pos         (8UL)          /*!< FMT (Bit 8)                                           */
 #define R_MIPI_DSI_SQCH0DSC5AR_H_FMT_Msk         (0x100UL)      /*!< FMT (Bitfield-Mask: 0x01)                             */
 #define R_MIPI_DSI_SQCH0DSC5AR_H_SPD_Pos         (9UL)          /*!< SPD (Bit 9)                                           */
 #define R_MIPI_DSI_SQCH0DSC5AR_H_SPD_Msk         (0x200UL)      /*!< SPD (Bitfield-Mask: 0x01)                             */
 #define R_MIPI_DSI_SQCH0DSC5AR_H_BTA_Pos         (10UL)         /*!< BTA (Bit 10)                                          */
 #define R_MIPI_DSI_SQCH0DSC5AR_H_BTA_Msk         (0xc00UL)      /*!< BTA (Bitfield-Mask: 0x03)                             */
 #define R_MIPI_DSI_SQCH0DSC5AR_H_NXACT_Pos       (12UL)         /*!< NXACT (Bit 12)                                        */
 #define R_MIPI_DSI_SQCH0DSC5AR_H_NXACT_Msk       (0x3000UL)     /*!< NXACT (Bitfield-Mask: 0x03)                           */
/* =====================================================  SQCH0DSC6AR_H  ===================================================== */
 #define R_MIPI_DSI_SQCH0DSC6AR_H_DT_Pos          (0UL)          /*!< DT (Bit 0)                                            */
 #define R_MIPI_DSI_SQCH0DSC6AR_H_DT_Msk          (0x3fUL)       /*!< DT (Bitfield-Mask: 0x3f)                              */
 #define R_MIPI_DSI_SQCH0DSC6AR_H_VC_Pos          (6UL)          /*!< VC (Bit 6)                                            */
 #define R_MIPI_DSI_SQCH0DSC6AR_H_VC_Msk          (0xc0UL)       /*!< VC (Bitfield-Mask: 0x03)                              */
 #define R_MIPI_DSI_SQCH0DSC6AR_H_FMT_Pos         (8UL)          /*!< FMT (Bit 8)                                           */
 #define R_MIPI_DSI_SQCH0DSC6AR_H_FMT_Msk         (0x100UL)      /*!< FMT (Bitfield-Mask: 0x01)                             */
 #define R_MIPI_DSI_SQCH0DSC6AR_H_SPD_Pos         (9UL)          /*!< SPD (Bit 9)                                           */
 #define R_MIPI_DSI_SQCH0DSC6AR_H_SPD_Msk         (0x200UL)      /*!< SPD (Bitfield-Mask: 0x01)                             */
 #define R_MIPI_DSI_SQCH0DSC6AR_H_BTA_Pos         (10UL)         /*!< BTA (Bit 10)                                          */
 #define R_MIPI_DSI_SQCH0DSC6AR_H_BTA_Msk         (0xc00UL)      /*!< BTA (Bitfield-Mask: 0x03)                             */
 #define R_MIPI_DSI_SQCH0DSC6AR_H_NXACT_Pos       (12UL)         /*!< NXACT (Bit 12)                                        */
 #define R_MIPI_DSI_SQCH0DSC6AR_H_NXACT_Msk       (0x3000UL)     /*!< NXACT (Bitfield-Mask: 0x03)                           */
/* =====================================================  SQCH0DSC7AR_H  ===================================================== */
 #define R_MIPI_DSI_SQCH0DSC7AR_H_DT_Pos          (0UL)          /*!< DT (Bit 0)                                            */
 #define R_MIPI_DSI_SQCH0DSC7AR_H_DT_Msk          (0x3fUL)       /*!< DT (Bitfield-Mask: 0x3f)                              */
 #define R_MIPI_DSI_SQCH0DSC7AR_H_VC_Pos          (6UL)          /*!< VC (Bit 6)                                            */
 #define R_MIPI_DSI_SQCH0DSC7AR_H_VC_Msk          (0xc0UL)       /*!< VC (Bitfield-Mask: 0x03)                              */
 #define R_MIPI_DSI_SQCH0DSC7AR_H_FMT_Pos         (8UL)          /*!< FMT (Bit 8)                                           */
 #define R_MIPI_DSI_SQCH0DSC7AR_H_FMT_Msk         (0x100UL)      /*!< FMT (Bitfield-Mask: 0x01)                             */
 #define R_MIPI_DSI_SQCH0DSC7AR_H_SPD_Pos         (9UL)          /*!< SPD (Bit 9)                                           */
 #define R_MIPI_DSI_SQCH0DSC7AR_H_SPD_Msk         (0x200UL)      /*!< SPD (Bitfield-Mask: 0x01)                             */
 #define R_MIPI_DSI_SQCH0DSC7AR_H_BTA_Pos         (10UL)         /*!< BTA (Bit 10)                                          */
 #define R_MIPI_DSI_SQCH0DSC7AR_H_BTA_Msk         (0xc00UL)      /*!< BTA (Bitfield-Mask: 0x03)                             */
 #define R_MIPI_DSI_SQCH0DSC7AR_H_NXACT_Pos       (12UL)         /*!< NXACT (Bit 12)                                        */
 #define R_MIPI_DSI_SQCH0DSC7AR_H_NXACT_Msk       (0x3000UL)     /*!< NXACT (Bitfield-Mask: 0x03)                           */
/* ====================================================  SQCH0DSC0AR_HL  ===================================================== */
 #define R_MIPI_DSI_SQCH0DSC0AR_HL_DT_Pos         (0UL)          /*!< DT (Bit 0)                                            */
 #define R_MIPI_DSI_SQCH0DSC0AR_HL_DT_Msk         (0x3fUL)       /*!< DT (Bitfield-Mask: 0x3f)                              */
 #define R_MIPI_DSI_SQCH0DSC0AR_HL_VC_Pos         (6UL)          /*!< VC (Bit 6)                                            */
 #define R_MIPI_DSI_SQCH0DSC0AR_HL_VC_Msk         (0xc0UL)       /*!< VC (Bitfield-Mask: 0x03)                              */
/* ====================================================  SQCH0DSC1AR_HL  ===================================================== */
 #define R_MIPI_DSI_SQCH0DSC1AR_HL_DT_Pos         (0UL)          /*!< DT (Bit 0)                                            */
 #define R_MIPI_DSI_SQCH0DSC1AR_HL_DT_Msk         (0x3fUL)       /*!< DT (Bitfield-Mask: 0x3f)                              */
 #define R_MIPI_DSI_SQCH0DSC1AR_HL_VC_Pos         (6UL)          /*!< VC (Bit 6)                                            */
 #define R_MIPI_DSI_SQCH0DSC1AR_HL_VC_Msk         (0xc0UL)       /*!< VC (Bitfield-Mask: 0x03)                              */
/* ====================================================  SQCH0DSC2AR_HL  ===================================================== */
 #define R_MIPI_DSI_SQCH0DSC2AR_HL_DT_Pos         (0UL)          /*!< DT (Bit 0)                                            */
 #define R_MIPI_DSI_SQCH0DSC2AR_HL_DT_Msk         (0x3fUL)       /*!< DT (Bitfield-Mask: 0x3f)                              */
 #define R_MIPI_DSI_SQCH0DSC2AR_HL_VC_Pos         (6UL)          /*!< VC (Bit 6)                                            */
 #define R_MIPI_DSI_SQCH0DSC2AR_HL_VC_Msk         (0xc0UL)       /*!< VC (Bitfield-Mask: 0x03)                              */
/* ====================================================  SQCH0DSC3AR_HL  ===================================================== */
 #define R_MIPI_DSI_SQCH0DSC3AR_HL_DT_Pos         (0UL)          /*!< DT (Bit 0)                                            */
 #define R_MIPI_DSI_SQCH0DSC3AR_HL_DT_Msk         (0x3fUL)       /*!< DT (Bitfield-Mask: 0x3f)                              */
 #define R_MIPI_DSI_SQCH0DSC3AR_HL_VC_Pos         (6UL)          /*!< VC (Bit 6)                                            */
 #define R_MIPI_DSI_SQCH0DSC3AR_HL_VC_Msk         (0xc0UL)       /*!< VC (Bitfield-Mask: 0x03)                              */
/* ====================================================  SQCH0DSC4AR_HL  ===================================================== */
 #define R_MIPI_DSI_SQCH0DSC4AR_HL_DT_Pos         (0UL)          /*!< DT (Bit 0)                                            */
 #define R_MIPI_DSI_SQCH0DSC4AR_HL_DT_Msk         (0x3fUL)       /*!< DT (Bitfield-Mask: 0x3f)                              */
 #define R_MIPI_DSI_SQCH0DSC4AR_HL_VC_Pos         (6UL)          /*!< VC (Bit 6)                                            */
 #define R_MIPI_DSI_SQCH0DSC4AR_HL_VC_Msk         (0xc0UL)       /*!< VC (Bitfield-Mask: 0x03)                              */
/* ====================================================  SQCH0DSC5AR_HL  ===================================================== */
 #define R_MIPI_DSI_SQCH0DSC5AR_HL_DT_Pos         (0UL)          /*!< DT (Bit 0)                                            */
 #define R_MIPI_DSI_SQCH0DSC5AR_HL_DT_Msk         (0x3fUL)       /*!< DT (Bitfield-Mask: 0x3f)                              */
 #define R_MIPI_DSI_SQCH0DSC5AR_HL_VC_Pos         (6UL)          /*!< VC (Bit 6)                                            */
 #define R_MIPI_DSI_SQCH0DSC5AR_HL_VC_Msk         (0xc0UL)       /*!< VC (Bitfield-Mask: 0x03)                              */
/* ====================================================  SQCH0DSC6AR_HL  ===================================================== */
 #define R_MIPI_DSI_SQCH0DSC6AR_HL_DT_Pos         (0UL)          /*!< DT (Bit 0)                                            */
 #define R_MIPI_DSI_SQCH0DSC6AR_HL_DT_Msk         (0x3fUL)       /*!< DT (Bitfield-Mask: 0x3f)                              */
 #define R_MIPI_DSI_SQCH0DSC6AR_HL_VC_Pos         (6UL)          /*!< VC (Bit 6)                                            */
 #define R_MIPI_DSI_SQCH0DSC6AR_HL_VC_Msk         (0xc0UL)       /*!< VC (Bitfield-Mask: 0x03)                              */
/* ====================================================  SQCH0DSC7AR_HL  ===================================================== */
 #define R_MIPI_DSI_SQCH0DSC7AR_HL_DT_Pos         (0UL)          /*!< DT (Bit 0)                                            */
 #define R_MIPI_DSI_SQCH0DSC7AR_HL_DT_Msk         (0x3fUL)       /*!< DT (Bitfield-Mask: 0x3f)                              */
 #define R_MIPI_DSI_SQCH0DSC7AR_HL_VC_Pos         (6UL)          /*!< VC (Bit 6)                                            */
 #define R_MIPI_DSI_SQCH0DSC7AR_HL_VC_Msk         (0xc0UL)       /*!< VC (Bitfield-Mask: 0x03)                              */
/* ====================================================  SQCH0DSC0AR_HH  ===================================================== */
 #define R_MIPI_DSI_SQCH0DSC0AR_HH_FMT_Pos        (0UL)          /*!< FMT (Bit 0)                                           */
 #define R_MIPI_DSI_SQCH0DSC0AR_HH_FMT_Msk        (0x1UL)        /*!< FMT (Bitfield-Mask: 0x01)                             */
 #define R_MIPI_DSI_SQCH0DSC0AR_HH_SPD_Pos        (1UL)          /*!< SPD (Bit 1)                                           */
 #define R_MIPI_DSI_SQCH0DSC0AR_HH_SPD_Msk        (0x2UL)        /*!< SPD (Bitfield-Mask: 0x01)                             */
 #define R_MIPI_DSI_SQCH0DSC0AR_HH_BTA_Pos        (2UL)          /*!< BTA (Bit 2)                                           */
 #define R_MIPI_DSI_SQCH0DSC0AR_HH_BTA_Msk        (0xcUL)        /*!< BTA (Bitfield-Mask: 0x03)                             */
 #define R_MIPI_DSI_SQCH0DSC0AR_HH_NXACT_Pos      (4UL)          /*!< NXACT (Bit 4)                                         */
 #define R_MIPI_DSI_SQCH0DSC0AR_HH_NXACT_Msk      (0x30UL)       /*!< NXACT (Bitfield-Mask: 0x03)                           */
/* ====================================================  SQCH0DSC1AR_HH  ===================================================== */
 #define R_MIPI_DSI_SQCH0DSC1AR_HH_FMT_Pos        (0UL)          /*!< FMT (Bit 0)                                           */
 #define R_MIPI_DSI_SQCH0DSC1AR_HH_FMT_Msk        (0x1UL)        /*!< FMT (Bitfield-Mask: 0x01)                             */
 #define R_MIPI_DSI_SQCH0DSC1AR_HH_SPD_Pos        (1UL)          /*!< SPD (Bit 1)                                           */
 #define R_MIPI_DSI_SQCH0DSC1AR_HH_SPD_Msk        (0x2UL)        /*!< SPD (Bitfield-Mask: 0x01)                             */
 #define R_MIPI_DSI_SQCH0DSC1AR_HH_BTA_Pos        (2UL)          /*!< BTA (Bit 2)                                           */
 #define R_MIPI_DSI_SQCH0DSC1AR_HH_BTA_Msk        (0xcUL)        /*!< BTA (Bitfield-Mask: 0x03)                             */
 #define R_MIPI_DSI_SQCH0DSC1AR_HH_NXACT_Pos      (4UL)          /*!< NXACT (Bit 4)                                         */
 #define R_MIPI_DSI_SQCH0DSC1AR_HH_NXACT_Msk      (0x30UL)       /*!< NXACT (Bitfield-Mask: 0x03)                           */
/* ====================================================  SQCH0DSC2AR_HH  ===================================================== */
 #define R_MIPI_DSI_SQCH0DSC2AR_HH_FMT_Pos        (0UL)          /*!< FMT (Bit 0)                                           */
 #define R_MIPI_DSI_SQCH0DSC2AR_HH_FMT_Msk        (0x1UL)        /*!< FMT (Bitfield-Mask: 0x01)                             */
 #define R_MIPI_DSI_SQCH0DSC2AR_HH_SPD_Pos        (1UL)          /*!< SPD (Bit 1)                                           */
 #define R_MIPI_DSI_SQCH0DSC2AR_HH_SPD_Msk        (0x2UL)        /*!< SPD (Bitfield-Mask: 0x01)                             */
 #define R_MIPI_DSI_SQCH0DSC2AR_HH_BTA_Pos        (2UL)          /*!< BTA (Bit 2)                                           */
 #define R_MIPI_DSI_SQCH0DSC2AR_HH_BTA_Msk        (0xcUL)        /*!< BTA (Bitfield-Mask: 0x03)                             */
 #define R_MIPI_DSI_SQCH0DSC2AR_HH_NXACT_Pos      (4UL)          /*!< NXACT (Bit 4)                                         */
 #define R_MIPI_DSI_SQCH0DSC2AR_HH_NXACT_Msk      (0x30UL)       /*!< NXACT (Bitfield-Mask: 0x03)                           */
/* ====================================================  SQCH0DSC3AR_HH  ===================================================== */
 #define R_MIPI_DSI_SQCH0DSC3AR_HH_FMT_Pos        (0UL)          /*!< FMT (Bit 0)                                           */
 #define R_MIPI_DSI_SQCH0DSC3AR_HH_FMT_Msk        (0x1UL)        /*!< FMT (Bitfield-Mask: 0x01)                             */
 #define R_MIPI_DSI_SQCH0DSC3AR_HH_SPD_Pos        (1UL)          /*!< SPD (Bit 1)                                           */
 #define R_MIPI_DSI_SQCH0DSC3AR_HH_SPD_Msk        (0x2UL)        /*!< SPD (Bitfield-Mask: 0x01)                             */
 #define R_MIPI_DSI_SQCH0DSC3AR_HH_BTA_Pos        (2UL)          /*!< BTA (Bit 2)                                           */
 #define R_MIPI_DSI_SQCH0DSC3AR_HH_BTA_Msk        (0xcUL)        /*!< BTA (Bitfield-Mask: 0x03)                             */
 #define R_MIPI_DSI_SQCH0DSC3AR_HH_NXACT_Pos      (4UL)          /*!< NXACT (Bit 4)                                         */
 #define R_MIPI_DSI_SQCH0DSC3AR_HH_NXACT_Msk      (0x30UL)       /*!< NXACT (Bitfield-Mask: 0x03)                           */
/* ====================================================  SQCH0DSC4AR_HH  ===================================================== */
 #define R_MIPI_DSI_SQCH0DSC4AR_HH_FMT_Pos        (0UL)          /*!< FMT (Bit 0)                                           */
 #define R_MIPI_DSI_SQCH0DSC4AR_HH_FMT_Msk        (0x1UL)        /*!< FMT (Bitfield-Mask: 0x01)                             */
 #define R_MIPI_DSI_SQCH0DSC4AR_HH_SPD_Pos        (1UL)          /*!< SPD (Bit 1)                                           */
 #define R_MIPI_DSI_SQCH0DSC4AR_HH_SPD_Msk        (0x2UL)        /*!< SPD (Bitfield-Mask: 0x01)                             */
 #define R_MIPI_DSI_SQCH0DSC4AR_HH_BTA_Pos        (2UL)          /*!< BTA (Bit 2)                                           */
 #define R_MIPI_DSI_SQCH0DSC4AR_HH_BTA_Msk        (0xcUL)        /*!< BTA (Bitfield-Mask: 0x03)                             */
 #define R_MIPI_DSI_SQCH0DSC4AR_HH_NXACT_Pos      (4UL)          /*!< NXACT (Bit 4)                                         */
 #define R_MIPI_DSI_SQCH0DSC4AR_HH_NXACT_Msk      (0x30UL)       /*!< NXACT (Bitfield-Mask: 0x03)                           */
/* ====================================================  SQCH0DSC5AR_HH  ===================================================== */
 #define R_MIPI_DSI_SQCH0DSC5AR_HH_FMT_Pos        (0UL)          /*!< FMT (Bit 0)                                           */
 #define R_MIPI_DSI_SQCH0DSC5AR_HH_FMT_Msk        (0x1UL)        /*!< FMT (Bitfield-Mask: 0x01)                             */
 #define R_MIPI_DSI_SQCH0DSC5AR_HH_SPD_Pos        (1UL)          /*!< SPD (Bit 1)                                           */
 #define R_MIPI_DSI_SQCH0DSC5AR_HH_SPD_Msk        (0x2UL)        /*!< SPD (Bitfield-Mask: 0x01)                             */
 #define R_MIPI_DSI_SQCH0DSC5AR_HH_BTA_Pos        (2UL)          /*!< BTA (Bit 2)                                           */
 #define R_MIPI_DSI_SQCH0DSC5AR_HH_BTA_Msk        (0xcUL)        /*!< BTA (Bitfield-Mask: 0x03)                             */
 #define R_MIPI_DSI_SQCH0DSC5AR_HH_NXACT_Pos      (4UL)          /*!< NXACT (Bit 4)                                         */
 #define R_MIPI_DSI_SQCH0DSC5AR_HH_NXACT_Msk      (0x30UL)       /*!< NXACT (Bitfield-Mask: 0x03)                           */
/* ====================================================  SQCH0DSC6AR_HH  ===================================================== */
 #define R_MIPI_DSI_SQCH0DSC6AR_HH_FMT_Pos        (0UL)          /*!< FMT (Bit 0)                                           */
 #define R_MIPI_DSI_SQCH0DSC6AR_HH_FMT_Msk        (0x1UL)        /*!< FMT (Bitfield-Mask: 0x01)                             */
 #define R_MIPI_DSI_SQCH0DSC6AR_HH_SPD_Pos        (1UL)          /*!< SPD (Bit 1)                                           */
 #define R_MIPI_DSI_SQCH0DSC6AR_HH_SPD_Msk        (0x2UL)        /*!< SPD (Bitfield-Mask: 0x01)                             */
 #define R_MIPI_DSI_SQCH0DSC6AR_HH_BTA_Pos        (2UL)          /*!< BTA (Bit 2)                                           */
