MikroElektronika/core_packages/ARM/gcc_clang/def/renesas/R7FA8D1BHDCBD/mcu.h
/* =====================================================  SQCH1DSC6AR_L  ===================================================== */
 #define R_MIPI_DSI_SQCH1DSC6AR_L_DATA0_Pos       (0UL)          /*!< DATA0 (Bit 0)                                         */
 #define R_MIPI_DSI_SQCH1DSC6AR_L_DATA0_Msk       (0xffUL)       /*!< DATA0 (Bitfield-Mask: 0xff)                           */
 #define R_MIPI_DSI_SQCH1DSC6AR_L_DATA1_Pos       (8UL)          /*!< DATA1 (Bit 8)                                         */
 #define R_MIPI_DSI_SQCH1DSC6AR_L_DATA1_Msk       (0xff00UL)     /*!< DATA1 (Bitfield-Mask: 0xff)                           */
/* =====================================================  SQCH1DSC7AR_L  ===================================================== */
 #define R_MIPI_DSI_SQCH1DSC7AR_L_DATA0_Pos       (0UL)          /*!< DATA0 (Bit 0)                                         */
 #define R_MIPI_DSI_SQCH1DSC7AR_L_DATA0_Msk       (0xffUL)       /*!< DATA0 (Bitfield-Mask: 0xff)                           */
 #define R_MIPI_DSI_SQCH1DSC7AR_L_DATA1_Pos       (8UL)          /*!< DATA1 (Bit 8)                                         */
 #define R_MIPI_DSI_SQCH1DSC7AR_L_DATA1_Msk       (0xff00UL)     /*!< DATA1 (Bitfield-Mask: 0xff)                           */
/* ====================================================  SQCH1DSC0AR_LL  ===================================================== */
 #define R_MIPI_DSI_SQCH1DSC0AR_LL_DATA0_Pos      (0UL)          /*!< DATA0 (Bit 0)                                         */
 #define R_MIPI_DSI_SQCH1DSC0AR_LL_DATA0_Msk      (0xffUL)       /*!< DATA0 (Bitfield-Mask: 0xff)                           */
/* ====================================================  SQCH1DSC1AR_LL  ===================================================== */
 #define R_MIPI_DSI_SQCH1DSC1AR_LL_DATA0_Pos      (0UL)          /*!< DATA0 (Bit 0)                                         */
 #define R_MIPI_DSI_SQCH1DSC1AR_LL_DATA0_Msk      (0xffUL)       /*!< DATA0 (Bitfield-Mask: 0xff)                           */
/* ====================================================  SQCH1DSC2AR_LL  ===================================================== */
 #define R_MIPI_DSI_SQCH1DSC2AR_LL_DATA0_Pos      (0UL)          /*!< DATA0 (Bit 0)                                         */
 #define R_MIPI_DSI_SQCH1DSC2AR_LL_DATA0_Msk      (0xffUL)       /*!< DATA0 (Bitfield-Mask: 0xff)                           */
/* ====================================================  SQCH1DSC3AR_LL  ===================================================== */
 #define R_MIPI_DSI_SQCH1DSC3AR_LL_DATA0_Pos      (0UL)          /*!< DATA0 (Bit 0)                                         */
 #define R_MIPI_DSI_SQCH1DSC3AR_LL_DATA0_Msk      (0xffUL)       /*!< DATA0 (Bitfield-Mask: 0xff)                           */
/* ====================================================  SQCH1DSC4AR_LL  ===================================================== */
 #define R_MIPI_DSI_SQCH1DSC4AR_LL_DATA0_Pos      (0UL)          /*!< DATA0 (Bit 0)                                         */
 #define R_MIPI_DSI_SQCH1DSC4AR_LL_DATA0_Msk      (0xffUL)       /*!< DATA0 (Bitfield-Mask: 0xff)                           */
/* ====================================================  SQCH1DSC5AR_LL  ===================================================== */
 #define R_MIPI_DSI_SQCH1DSC5AR_LL_DATA0_Pos      (0UL)          /*!< DATA0 (Bit 0)                                         */
 #define R_MIPI_DSI_SQCH1DSC5AR_LL_DATA0_Msk      (0xffUL)       /*!< DATA0 (Bitfield-Mask: 0xff)                           */
/* ====================================================  SQCH1DSC6AR_LL  ===================================================== */
 #define R_MIPI_DSI_SQCH1DSC6AR_LL_DATA0_Pos      (0UL)          /*!< DATA0 (Bit 0)                                         */
 #define R_MIPI_DSI_SQCH1DSC6AR_LL_DATA0_Msk      (0xffUL)       /*!< DATA0 (Bitfield-Mask: 0xff)                           */
/* ====================================================  SQCH1DSC7AR_LL  ===================================================== */
 #define R_MIPI_DSI_SQCH1DSC7AR_LL_DATA0_Pos      (0UL)          /*!< DATA0 (Bit 0)                                         */
 #define R_MIPI_DSI_SQCH1DSC7AR_LL_DATA0_Msk      (0xffUL)       /*!< DATA0 (Bitfield-Mask: 0xff)                           */
/* ====================================================  SQCH1DSC0AR_LH  ===================================================== */
 #define R_MIPI_DSI_SQCH1DSC0AR_LH_DATA1_Pos      (0UL)          /*!< DATA1 (Bit 0)                                         */
 #define R_MIPI_DSI_SQCH1DSC0AR_LH_DATA1_Msk      (0xffUL)       /*!< DATA1 (Bitfield-Mask: 0xff)                           */
/* ====================================================  SQCH1DSC1AR_LH  ===================================================== */
 #define R_MIPI_DSI_SQCH1DSC1AR_LH_DATA1_Pos      (0UL)          /*!< DATA1 (Bit 0)                                         */
 #define R_MIPI_DSI_SQCH1DSC1AR_LH_DATA1_Msk      (0xffUL)       /*!< DATA1 (Bitfield-Mask: 0xff)                           */
/* ====================================================  SQCH1DSC2AR_LH  ===================================================== */
 #define R_MIPI_DSI_SQCH1DSC2AR_LH_DATA1_Pos      (0UL)          /*!< DATA1 (Bit 0)                                         */
 #define R_MIPI_DSI_SQCH1DSC2AR_LH_DATA1_Msk      (0xffUL)       /*!< DATA1 (Bitfield-Mask: 0xff)                           */
/* ====================================================  SQCH1DSC3AR_LH  ===================================================== */
 #define R_MIPI_DSI_SQCH1DSC3AR_LH_DATA1_Pos      (0UL)          /*!< DATA1 (Bit 0)                                         */
 #define R_MIPI_DSI_SQCH1DSC3AR_LH_DATA1_Msk      (0xffUL)       /*!< DATA1 (Bitfield-Mask: 0xff)                           */
/* ====================================================  SQCH1DSC4AR_LH  ===================================================== */
 #define R_MIPI_DSI_SQCH1DSC4AR_LH_DATA1_Pos      (0UL)          /*!< DATA1 (Bit 0)                                         */
 #define R_MIPI_DSI_SQCH1DSC4AR_LH_DATA1_Msk      (0xffUL)       /*!< DATA1 (Bitfield-Mask: 0xff)                           */
/* ====================================================  SQCH1DSC5AR_LH  ===================================================== */
 #define R_MIPI_DSI_SQCH1DSC5AR_LH_DATA1_Pos      (0UL)          /*!< DATA1 (Bit 0)                                         */
 #define R_MIPI_DSI_SQCH1DSC5AR_LH_DATA1_Msk      (0xffUL)       /*!< DATA1 (Bitfield-Mask: 0xff)                           */
/* ====================================================  SQCH1DSC6AR_LH  ===================================================== */
 #define R_MIPI_DSI_SQCH1DSC6AR_LH_DATA1_Pos      (0UL)          /*!< DATA1 (Bit 0)                                         */
 #define R_MIPI_DSI_SQCH1DSC6AR_LH_DATA1_Msk      (0xffUL)       /*!< DATA1 (Bitfield-Mask: 0xff)                           */
/* ====================================================  SQCH1DSC7AR_LH  ===================================================== */
 #define R_MIPI_DSI_SQCH1DSC7AR_LH_DATA1_Pos      (0UL)          /*!< DATA1 (Bit 0)                                         */
 #define R_MIPI_DSI_SQCH1DSC7AR_LH_DATA1_Msk      (0xffUL)       /*!< DATA1 (Bitfield-Mask: 0xff)                           */
/* =====================================================  SQCH1DSC0AR_H  ===================================================== */
 #define R_MIPI_DSI_SQCH1DSC0AR_H_DT_Pos          (0UL)          /*!< DT (Bit 0)                                            */
 #define R_MIPI_DSI_SQCH1DSC0AR_H_DT_Msk          (0x3fUL)       /*!< DT (Bitfield-Mask: 0x3f)                              */
 #define R_MIPI_DSI_SQCH1DSC0AR_H_VC_Pos          (6UL)          /*!< VC (Bit 6)                                            */
 #define R_MIPI_DSI_SQCH1DSC0AR_H_VC_Msk          (0xc0UL)       /*!< VC (Bitfield-Mask: 0x03)                              */
 #define R_MIPI_DSI_SQCH1DSC0AR_H_FMT_Pos         (8UL)          /*!< FMT (Bit 8)                                           */
 #define R_MIPI_DSI_SQCH1DSC0AR_H_FMT_Msk         (0x100UL)      /*!< FMT (Bitfield-Mask: 0x01)                             */
 #define R_MIPI_DSI_SQCH1DSC0AR_H_SPD_Pos         (9UL)          /*!< SPD (Bit 9)                                           */
 #define R_MIPI_DSI_SQCH1DSC0AR_H_SPD_Msk         (0x200UL)      /*!< SPD (Bitfield-Mask: 0x01)                             */
 #define R_MIPI_DSI_SQCH1DSC0AR_H_BTA_Pos         (10UL)         /*!< BTA (Bit 10)                                          */
 #define R_MIPI_DSI_SQCH1DSC0AR_H_BTA_Msk         (0xc00UL)      /*!< BTA (Bitfield-Mask: 0x03)                             */
 #define R_MIPI_DSI_SQCH1DSC0AR_H_NXACT_Pos       (12UL)         /*!< NXACT (Bit 12)                                        */
 #define R_MIPI_DSI_SQCH1DSC0AR_H_NXACT_Msk       (0x3000UL)     /*!< NXACT (Bitfield-Mask: 0x03)                           */
/* =====================================================  SQCH1DSC1AR_H  ===================================================== */
 #define R_MIPI_DSI_SQCH1DSC1AR_H_DT_Pos          (0UL)          /*!< DT (Bit 0)                                            */
 #define R_MIPI_DSI_SQCH1DSC1AR_H_DT_Msk          (0x3fUL)       /*!< DT (Bitfield-Mask: 0x3f)                              */
 #define R_MIPI_DSI_SQCH1DSC1AR_H_VC_Pos          (6UL)          /*!< VC (Bit 6)                                            */
 #define R_MIPI_DSI_SQCH1DSC1AR_H_VC_Msk          (0xc0UL)       /*!< VC (Bitfield-Mask: 0x03)                              */
 #define R_MIPI_DSI_SQCH1DSC1AR_H_FMT_Pos         (8UL)          /*!< FMT (Bit 8)                                           */
 #define R_MIPI_DSI_SQCH1DSC1AR_H_FMT_Msk         (0x100UL)      /*!< FMT (Bitfield-Mask: 0x01)                             */
 #define R_MIPI_DSI_SQCH1DSC1AR_H_SPD_Pos         (9UL)          /*!< SPD (Bit 9)                                           */
 #define R_MIPI_DSI_SQCH1DSC1AR_H_SPD_Msk         (0x200UL)      /*!< SPD (Bitfield-Mask: 0x01)                             */
 #define R_MIPI_DSI_SQCH1DSC1AR_H_BTA_Pos         (10UL)         /*!< BTA (Bit 10)                                          */
 #define R_MIPI_DSI_SQCH1DSC1AR_H_BTA_Msk         (0xc00UL)      /*!< BTA (Bitfield-Mask: 0x03)                             */
 #define R_MIPI_DSI_SQCH1DSC1AR_H_NXACT_Pos       (12UL)         /*!< NXACT (Bit 12)                                        */
 #define R_MIPI_DSI_SQCH1DSC1AR_H_NXACT_Msk       (0x3000UL)     /*!< NXACT (Bitfield-Mask: 0x03)                           */
/* =====================================================  SQCH1DSC2AR_H  ===================================================== */
 #define R_MIPI_DSI_SQCH1DSC2AR_H_DT_Pos          (0UL)          /*!< DT (Bit 0)                                            */
 #define R_MIPI_DSI_SQCH1DSC2AR_H_DT_Msk          (0x3fUL)       /*!< DT (Bitfield-Mask: 0x3f)                              */
 #define R_MIPI_DSI_SQCH1DSC2AR_H_VC_Pos          (6UL)          /*!< VC (Bit 6)                                            */
 #define R_MIPI_DSI_SQCH1DSC2AR_H_VC_Msk          (0xc0UL)       /*!< VC (Bitfield-Mask: 0x03)                              */
 #define R_MIPI_DSI_SQCH1DSC2AR_H_FMT_Pos         (8UL)          /*!< FMT (Bit 8)                                           */
 #define R_MIPI_DSI_SQCH1DSC2AR_H_FMT_Msk         (0x100UL)      /*!< FMT (Bitfield-Mask: 0x01)                             */
 #define R_MIPI_DSI_SQCH1DSC2AR_H_SPD_Pos         (9UL)          /*!< SPD (Bit 9)                                           */
 #define R_MIPI_DSI_SQCH1DSC2AR_H_SPD_Msk         (0x200UL)      /*!< SPD (Bitfield-Mask: 0x01)                             */
 #define R_MIPI_DSI_SQCH1DSC2AR_H_BTA_Pos         (10UL)         /*!< BTA (Bit 10)                                          */
 #define R_MIPI_DSI_SQCH1DSC2AR_H_BTA_Msk         (0xc00UL)      /*!< BTA (Bitfield-Mask: 0x03)                             */
 #define R_MIPI_DSI_SQCH1DSC2AR_H_NXACT_Pos       (12UL)         /*!< NXACT (Bit 12)                                        */
 #define R_MIPI_DSI_SQCH1DSC2AR_H_NXACT_Msk       (0x3000UL)     /*!< NXACT (Bitfield-Mask: 0x03)                           */
/* =====================================================  SQCH1DSC3AR_H  ===================================================== */
 #define R_MIPI_DSI_SQCH1DSC3AR_H_DT_Pos          (0UL)          /*!< DT (Bit 0)                                            */
 #define R_MIPI_DSI_SQCH1DSC3AR_H_DT_Msk          (0x3fUL)       /*!< DT (Bitfield-Mask: 0x3f)                              */
 #define R_MIPI_DSI_SQCH1DSC3AR_H_VC_Pos          (6UL)          /*!< VC (Bit 6)                                            */
 #define R_MIPI_DSI_SQCH1DSC3AR_H_VC_Msk          (0xc0UL)       /*!< VC (Bitfield-Mask: 0x03)                              */
 #define R_MIPI_DSI_SQCH1DSC3AR_H_FMT_Pos         (8UL)          /*!< FMT (Bit 8)                                           */
 #define R_MIPI_DSI_SQCH1DSC3AR_H_FMT_Msk         (0x100UL)      /*!< FMT (Bitfield-Mask: 0x01)                             */
 #define R_MIPI_DSI_SQCH1DSC3AR_H_SPD_Pos         (9UL)          /*!< SPD (Bit 9)                                           */
 #define R_MIPI_DSI_SQCH1DSC3AR_H_SPD_Msk         (0x200UL)      /*!< SPD (Bitfield-Mask: 0x01)                             */
 #define R_MIPI_DSI_SQCH1DSC3AR_H_BTA_Pos         (10UL)         /*!< BTA (Bit 10)                                          */
 #define R_MIPI_DSI_SQCH1DSC3AR_H_BTA_Msk         (0xc00UL)      /*!< BTA (Bitfield-Mask: 0x03)                             */
 #define R_MIPI_DSI_SQCH1DSC3AR_H_NXACT_Pos       (12UL)         /*!< NXACT (Bit 12)                                        */
 #define R_MIPI_DSI_SQCH1DSC3AR_H_NXACT_Msk       (0x3000UL)     /*!< NXACT (Bitfield-Mask: 0x03)                           */
/* =====================================================  SQCH1DSC4AR_H  ===================================================== */
 #define R_MIPI_DSI_SQCH1DSC4AR_H_DT_Pos          (0UL)          /*!< DT (Bit 0)                                            */
 #define R_MIPI_DSI_SQCH1DSC4AR_H_DT_Msk          (0x3fUL)       /*!< DT (Bitfield-Mask: 0x3f)                              */
 #define R_MIPI_DSI_SQCH1DSC4AR_H_VC_Pos          (6UL)          /*!< VC (Bit 6)                                            */
 #define R_MIPI_DSI_SQCH1DSC4AR_H_VC_Msk          (0xc0UL)       /*!< VC (Bitfield-Mask: 0x03)                              */
 #define R_MIPI_DSI_SQCH1DSC4AR_H_FMT_Pos         (8UL)          /*!< FMT (Bit 8)                                           */
 #define R_MIPI_DSI_SQCH1DSC4AR_H_FMT_Msk         (0x100UL)      /*!< FMT (Bitfield-Mask: 0x01)                             */
 #define R_MIPI_DSI_SQCH1DSC4AR_H_SPD_Pos         (9UL)          /*!< SPD (Bit 9)                                           */
 #define R_MIPI_DSI_SQCH1DSC4AR_H_SPD_Msk         (0x200UL)      /*!< SPD (Bitfield-Mask: 0x01)                             */
 #define R_MIPI_DSI_SQCH1DSC4AR_H_BTA_Pos         (10UL)         /*!< BTA (Bit 10)                                          */
 #define R_MIPI_DSI_SQCH1DSC4AR_H_BTA_Msk         (0xc00UL)      /*!< BTA (Bitfield-Mask: 0x03)                             */
 #define R_MIPI_DSI_SQCH1DSC4AR_H_NXACT_Pos       (12UL)         /*!< NXACT (Bit 12)                                        */
 #define R_MIPI_DSI_SQCH1DSC4AR_H_NXACT_Msk       (0x3000UL)     /*!< NXACT (Bitfield-Mask: 0x03)                           */
/* =====================================================  SQCH1DSC5AR_H  ===================================================== */
 #define R_MIPI_DSI_SQCH1DSC5AR_H_DT_Pos          (0UL)          /*!< DT (Bit 0)                                            */
 #define R_MIPI_DSI_SQCH1DSC5AR_H_DT_Msk          (0x3fUL)       /*!< DT (Bitfield-Mask: 0x3f)                              */
 #define R_MIPI_DSI_SQCH1DSC5AR_H_VC_Pos          (6UL)          /*!< VC (Bit 6)                                            */
 #define R_MIPI_DSI_SQCH1DSC5AR_H_VC_Msk          (0xc0UL)       /*!< VC (Bitfield-Mask: 0x03)                              */
 #define R_MIPI_DSI_SQCH1DSC5AR_H_FMT_Pos         (8UL)          /*!< FMT (Bit 8)                                           */
 #define R_MIPI_DSI_SQCH1DSC5AR_H_FMT_Msk         (0x100UL)      /*!< FMT (Bitfield-Mask: 0x01)                             */
 #define R_MIPI_DSI_SQCH1DSC5AR_H_SPD_Pos         (9UL)          /*!< SPD (Bit 9)                                           */
 #define R_MIPI_DSI_SQCH1DSC5AR_H_SPD_Msk         (0x200UL)      /*!< SPD (Bitfield-Mask: 0x01)                             */
 #define R_MIPI_DSI_SQCH1DSC5AR_H_BTA_Pos         (10UL)         /*!< BTA (Bit 10)                                          */
 #define R_MIPI_DSI_SQCH1DSC5AR_H_BTA_Msk         (0xc00UL)      /*!< BTA (Bitfield-Mask: 0x03)                             */
 #define R_MIPI_DSI_SQCH1DSC5AR_H_NXACT_Pos       (12UL)         /*!< NXACT (Bit 12)                                        */
 #define R_MIPI_DSI_SQCH1DSC5AR_H_NXACT_Msk       (0x3000UL)     /*!< NXACT (Bitfield-Mask: 0x03)                           */
/* =====================================================  SQCH1DSC6AR_H  ===================================================== */
 #define R_MIPI_DSI_SQCH1DSC6AR_H_DT_Pos          (0UL)          /*!< DT (Bit 0)                                            */
 #define R_MIPI_DSI_SQCH1DSC6AR_H_DT_Msk          (0x3fUL)       /*!< DT (Bitfield-Mask: 0x3f)                              */
 #define R_MIPI_DSI_SQCH1DSC6AR_H_VC_Pos          (6UL)          /*!< VC (Bit 6)                                            */
 #define R_MIPI_DSI_SQCH1DSC6AR_H_VC_Msk          (0xc0UL)       /*!< VC (Bitfield-Mask: 0x03)                              */
 #define R_MIPI_DSI_SQCH1DSC6AR_H_FMT_Pos         (8UL)          /*!< FMT (Bit 8)                                           */
 #define R_MIPI_DSI_SQCH1DSC6AR_H_FMT_Msk         (0x100UL)      /*!< FMT (Bitfield-Mask: 0x01)                             */
 #define R_MIPI_DSI_SQCH1DSC6AR_H_SPD_Pos         (9UL)          /*!< SPD (Bit 9)                                           */
 #define R_MIPI_DSI_SQCH1DSC6AR_H_SPD_Msk         (0x200UL)      /*!< SPD (Bitfield-Mask: 0x01)                             */
 #define R_MIPI_DSI_SQCH1DSC6AR_H_BTA_Pos         (10UL)         /*!< BTA (Bit 10)                                          */
 #define R_MIPI_DSI_SQCH1DSC6AR_H_BTA_Msk         (0xc00UL)      /*!< BTA (Bitfield-Mask: 0x03)                             */
 #define R_MIPI_DSI_SQCH1DSC6AR_H_NXACT_Pos       (12UL)         /*!< NXACT (Bit 12)                                        */
 #define R_MIPI_DSI_SQCH1DSC6AR_H_NXACT_Msk       (0x3000UL)     /*!< NXACT (Bitfield-Mask: 0x03)                           */
/* =====================================================  SQCH1DSC7AR_H  ===================================================== */
 #define R_MIPI_DSI_SQCH1DSC7AR_H_DT_Pos          (0UL)          /*!< DT (Bit 0)                                            */
 #define R_MIPI_DSI_SQCH1DSC7AR_H_DT_Msk          (0x3fUL)       /*!< DT (Bitfield-Mask: 0x3f)                              */
 #define R_MIPI_DSI_SQCH1DSC7AR_H_VC_Pos          (6UL)          /*!< VC (Bit 6)                                            */
 #define R_MIPI_DSI_SQCH1DSC7AR_H_VC_Msk          (0xc0UL)       /*!< VC (Bitfield-Mask: 0x03)                              */
 #define R_MIPI_DSI_SQCH1DSC7AR_H_FMT_Pos         (8UL)          /*!< FMT (Bit 8)                                           */
 #define R_MIPI_DSI_SQCH1DSC7AR_H_FMT_Msk         (0x100UL)      /*!< FMT (Bitfield-Mask: 0x01)                             */
 #define R_MIPI_DSI_SQCH1DSC7AR_H_SPD_Pos         (9UL)          /*!< SPD (Bit 9)                                           */
 #define R_MIPI_DSI_SQCH1DSC7AR_H_SPD_Msk         (0x200UL)      /*!< SPD (Bitfield-Mask: 0x01)                             */
 #define R_MIPI_DSI_SQCH1DSC7AR_H_BTA_Pos         (10UL)         /*!< BTA (Bit 10)                                          */
 #define R_MIPI_DSI_SQCH1DSC7AR_H_BTA_Msk         (0xc00UL)      /*!< BTA (Bitfield-Mask: 0x03)                             */
 #define R_MIPI_DSI_SQCH1DSC7AR_H_NXACT_Pos       (12UL)         /*!< NXACT (Bit 12)                                        */
 #define R_MIPI_DSI_SQCH1DSC7AR_H_NXACT_Msk       (0x3000UL)     /*!< NXACT (Bitfield-Mask: 0x03)                           */
/* ====================================================  SQCH1DSC0AR_HL  ===================================================== */
 #define R_MIPI_DSI_SQCH1DSC0AR_HL_DT_Pos         (0UL)          /*!< DT (Bit 0)                                            */
 #define R_MIPI_DSI_SQCH1DSC0AR_HL_DT_Msk         (0x3fUL)       /*!< DT (Bitfield-Mask: 0x3f)                              */
 #define R_MIPI_DSI_SQCH1DSC0AR_HL_VC_Pos         (6UL)          /*!< VC (Bit 6)                                            */
 #define R_MIPI_DSI_SQCH1DSC0AR_HL_VC_Msk         (0xc0UL)       /*!< VC (Bitfield-Mask: 0x03)                              */
/* ====================================================  SQCH1DSC1AR_HL  ===================================================== */
 #define R_MIPI_DSI_SQCH1DSC1AR_HL_DT_Pos         (0UL)          /*!< DT (Bit 0)                                            */
 #define R_MIPI_DSI_SQCH1DSC1AR_HL_DT_Msk         (0x3fUL)       /*!< DT (Bitfield-Mask: 0x3f)                              */
 #define R_MIPI_DSI_SQCH1DSC1AR_HL_VC_Pos         (6UL)          /*!< VC (Bit 6)                                            */
 #define R_MIPI_DSI_SQCH1DSC1AR_HL_VC_Msk         (0xc0UL)       /*!< VC (Bitfield-Mask: 0x03)                              */
/* ====================================================  SQCH1DSC2AR_HL  ===================================================== */
 #define R_MIPI_DSI_SQCH1DSC2AR_HL_DT_Pos         (0UL)          /*!< DT (Bit 0)                                            */
 #define R_MIPI_DSI_SQCH1DSC2AR_HL_DT_Msk         (0x3fUL)       /*!< DT (Bitfield-Mask: 0x3f)                              */
 #define R_MIPI_DSI_SQCH1DSC2AR_HL_VC_Pos         (6UL)          /*!< VC (Bit 6)                                            */
 #define R_MIPI_DSI_SQCH1DSC2AR_HL_VC_Msk         (0xc0UL)       /*!< VC (Bitfield-Mask: 0x03)                              */
/* ====================================================  SQCH1DSC3AR_HL  ===================================================== */
 #define R_MIPI_DSI_SQCH1DSC3AR_HL_DT_Pos         (0UL)          /*!< DT (Bit 0)                                            */
 #define R_MIPI_DSI_SQCH1DSC3AR_HL_DT_Msk         (0x3fUL)       /*!< DT (Bitfield-Mask: 0x3f)                              */
 #define R_MIPI_DSI_SQCH1DSC3AR_HL_VC_Pos         (6UL)          /*!< VC (Bit 6)                                            */
 #define R_MIPI_DSI_SQCH1DSC3AR_HL_VC_Msk         (0xc0UL)       /*!< VC (Bitfield-Mask: 0x03)                              */
/* ====================================================  SQCH1DSC4AR_HL  ===================================================== */
 #define R_MIPI_DSI_SQCH1DSC4AR_HL_DT_Pos         (0UL)          /*!< DT (Bit 0)                                            */
 #define R_MIPI_DSI_SQCH1DSC4AR_HL_DT_Msk         (0x3fUL)       /*!< DT (Bitfield-Mask: 0x3f)                              */
 #define R_MIPI_DSI_SQCH1DSC4AR_HL_VC_Pos         (6UL)          /*!< VC (Bit 6)                                            */
 #define R_MIPI_DSI_SQCH1DSC4AR_HL_VC_Msk         (0xc0UL)       /*!< VC (Bitfield-Mask: 0x03)                              */
/* ====================================================  SQCH1DSC5AR_HL  ===================================================== */
