MikroElektronika/core_packages/ARM/gcc_clang/def/renesas/R7FA8D1BHDCBD/mcu.h
 #define R_MIPI_DSI_SQCH1DSC5AR_HL_DT_Pos         (0UL)          /*!< DT (Bit 0)                                            */
 #define R_MIPI_DSI_SQCH1DSC5AR_HL_DT_Msk         (0x3fUL)       /*!< DT (Bitfield-Mask: 0x3f)                              */
 #define R_MIPI_DSI_SQCH1DSC5AR_HL_VC_Pos         (6UL)          /*!< VC (Bit 6)                                            */
 #define R_MIPI_DSI_SQCH1DSC5AR_HL_VC_Msk         (0xc0UL)       /*!< VC (Bitfield-Mask: 0x03)                              */
/* ====================================================  SQCH1DSC6AR_HL  ===================================================== */
 #define R_MIPI_DSI_SQCH1DSC6AR_HL_DT_Pos         (0UL)          /*!< DT (Bit 0)                                            */
 #define R_MIPI_DSI_SQCH1DSC6AR_HL_DT_Msk         (0x3fUL)       /*!< DT (Bitfield-Mask: 0x3f)                              */
 #define R_MIPI_DSI_SQCH1DSC6AR_HL_VC_Pos         (6UL)          /*!< VC (Bit 6)                                            */
 #define R_MIPI_DSI_SQCH1DSC6AR_HL_VC_Msk         (0xc0UL)       /*!< VC (Bitfield-Mask: 0x03)                              */
/* ====================================================  SQCH1DSC7AR_HL  ===================================================== */
 #define R_MIPI_DSI_SQCH1DSC7AR_HL_DT_Pos         (0UL)          /*!< DT (Bit 0)                                            */
 #define R_MIPI_DSI_SQCH1DSC7AR_HL_DT_Msk         (0x3fUL)       /*!< DT (Bitfield-Mask: 0x3f)                              */
 #define R_MIPI_DSI_SQCH1DSC7AR_HL_VC_Pos         (6UL)          /*!< VC (Bit 6)                                            */
 #define R_MIPI_DSI_SQCH1DSC7AR_HL_VC_Msk         (0xc0UL)       /*!< VC (Bitfield-Mask: 0x03)                              */
/* ====================================================  SQCH1DSC0AR_HH  ===================================================== */
 #define R_MIPI_DSI_SQCH1DSC0AR_HH_FMT_Pos        (0UL)          /*!< FMT (Bit 0)                                           */
 #define R_MIPI_DSI_SQCH1DSC0AR_HH_FMT_Msk        (0x1UL)        /*!< FMT (Bitfield-Mask: 0x01)                             */
 #define R_MIPI_DSI_SQCH1DSC0AR_HH_SPD_Pos        (1UL)          /*!< SPD (Bit 1)                                           */
 #define R_MIPI_DSI_SQCH1DSC0AR_HH_SPD_Msk        (0x2UL)        /*!< SPD (Bitfield-Mask: 0x01)                             */
 #define R_MIPI_DSI_SQCH1DSC0AR_HH_BTA_Pos        (2UL)          /*!< BTA (Bit 2)                                           */
 #define R_MIPI_DSI_SQCH1DSC0AR_HH_BTA_Msk        (0xcUL)        /*!< BTA (Bitfield-Mask: 0x03)                             */
 #define R_MIPI_DSI_SQCH1DSC0AR_HH_NXACT_Pos      (4UL)          /*!< NXACT (Bit 4)                                         */
 #define R_MIPI_DSI_SQCH1DSC0AR_HH_NXACT_Msk      (0x30UL)       /*!< NXACT (Bitfield-Mask: 0x03)                           */
/* ====================================================  SQCH1DSC1AR_HH  ===================================================== */
 #define R_MIPI_DSI_SQCH1DSC1AR_HH_FMT_Pos        (0UL)          /*!< FMT (Bit 0)                                           */
 #define R_MIPI_DSI_SQCH1DSC1AR_HH_FMT_Msk        (0x1UL)        /*!< FMT (Bitfield-Mask: 0x01)                             */
 #define R_MIPI_DSI_SQCH1DSC1AR_HH_SPD_Pos        (1UL)          /*!< SPD (Bit 1)                                           */
 #define R_MIPI_DSI_SQCH1DSC1AR_HH_SPD_Msk        (0x2UL)        /*!< SPD (Bitfield-Mask: 0x01)                             */
 #define R_MIPI_DSI_SQCH1DSC1AR_HH_BTA_Pos        (2UL)          /*!< BTA (Bit 2)                                           */
 #define R_MIPI_DSI_SQCH1DSC1AR_HH_BTA_Msk        (0xcUL)        /*!< BTA (Bitfield-Mask: 0x03)                             */
 #define R_MIPI_DSI_SQCH1DSC1AR_HH_NXACT_Pos      (4UL)          /*!< NXACT (Bit 4)                                         */
 #define R_MIPI_DSI_SQCH1DSC1AR_HH_NXACT_Msk      (0x30UL)       /*!< NXACT (Bitfield-Mask: 0x03)                           */
/* ====================================================  SQCH1DSC2AR_HH  ===================================================== */
 #define R_MIPI_DSI_SQCH1DSC2AR_HH_FMT_Pos        (0UL)          /*!< FMT (Bit 0)                                           */
 #define R_MIPI_DSI_SQCH1DSC2AR_HH_FMT_Msk        (0x1UL)        /*!< FMT (Bitfield-Mask: 0x01)                             */
 #define R_MIPI_DSI_SQCH1DSC2AR_HH_SPD_Pos        (1UL)          /*!< SPD (Bit 1)                                           */
 #define R_MIPI_DSI_SQCH1DSC2AR_HH_SPD_Msk        (0x2UL)        /*!< SPD (Bitfield-Mask: 0x01)                             */
 #define R_MIPI_DSI_SQCH1DSC2AR_HH_BTA_Pos        (2UL)          /*!< BTA (Bit 2)                                           */
 #define R_MIPI_DSI_SQCH1DSC2AR_HH_BTA_Msk        (0xcUL)        /*!< BTA (Bitfield-Mask: 0x03)                             */
 #define R_MIPI_DSI_SQCH1DSC2AR_HH_NXACT_Pos      (4UL)          /*!< NXACT (Bit 4)                                         */
 #define R_MIPI_DSI_SQCH1DSC2AR_HH_NXACT_Msk      (0x30UL)       /*!< NXACT (Bitfield-Mask: 0x03)                           */
/* ====================================================  SQCH1DSC3AR_HH  ===================================================== */
 #define R_MIPI_DSI_SQCH1DSC3AR_HH_FMT_Pos        (0UL)          /*!< FMT (Bit 0)                                           */
 #define R_MIPI_DSI_SQCH1DSC3AR_HH_FMT_Msk        (0x1UL)        /*!< FMT (Bitfield-Mask: 0x01)                             */
 #define R_MIPI_DSI_SQCH1DSC3AR_HH_SPD_Pos        (1UL)          /*!< SPD (Bit 1)                                           */
 #define R_MIPI_DSI_SQCH1DSC3AR_HH_SPD_Msk        (0x2UL)        /*!< SPD (Bitfield-Mask: 0x01)                             */
 #define R_MIPI_DSI_SQCH1DSC3AR_HH_BTA_Pos        (2UL)          /*!< BTA (Bit 2)                                           */
 #define R_MIPI_DSI_SQCH1DSC3AR_HH_BTA_Msk        (0xcUL)        /*!< BTA (Bitfield-Mask: 0x03)                             */
 #define R_MIPI_DSI_SQCH1DSC3AR_HH_NXACT_Pos      (4UL)          /*!< NXACT (Bit 4)                                         */
 #define R_MIPI_DSI_SQCH1DSC3AR_HH_NXACT_Msk      (0x30UL)       /*!< NXACT (Bitfield-Mask: 0x03)                           */
/* ====================================================  SQCH1DSC4AR_HH  ===================================================== */
 #define R_MIPI_DSI_SQCH1DSC4AR_HH_FMT_Pos        (0UL)          /*!< FMT (Bit 0)                                           */
 #define R_MIPI_DSI_SQCH1DSC4AR_HH_FMT_Msk        (0x1UL)        /*!< FMT (Bitfield-Mask: 0x01)                             */
 #define R_MIPI_DSI_SQCH1DSC4AR_HH_SPD_Pos        (1UL)          /*!< SPD (Bit 1)                                           */
 #define R_MIPI_DSI_SQCH1DSC4AR_HH_SPD_Msk        (0x2UL)        /*!< SPD (Bitfield-Mask: 0x01)                             */
 #define R_MIPI_DSI_SQCH1DSC4AR_HH_BTA_Pos        (2UL)          /*!< BTA (Bit 2)                                           */
 #define R_MIPI_DSI_SQCH1DSC4AR_HH_BTA_Msk        (0xcUL)        /*!< BTA (Bitfield-Mask: 0x03)                             */
 #define R_MIPI_DSI_SQCH1DSC4AR_HH_NXACT_Pos      (4UL)          /*!< NXACT (Bit 4)                                         */
 #define R_MIPI_DSI_SQCH1DSC4AR_HH_NXACT_Msk      (0x30UL)       /*!< NXACT (Bitfield-Mask: 0x03)                           */
/* ====================================================  SQCH1DSC5AR_HH  ===================================================== */
 #define R_MIPI_DSI_SQCH1DSC5AR_HH_FMT_Pos        (0UL)          /*!< FMT (Bit 0)                                           */
 #define R_MIPI_DSI_SQCH1DSC5AR_HH_FMT_Msk        (0x1UL)        /*!< FMT (Bitfield-Mask: 0x01)                             */
 #define R_MIPI_DSI_SQCH1DSC5AR_HH_SPD_Pos        (1UL)          /*!< SPD (Bit 1)                                           */
 #define R_MIPI_DSI_SQCH1DSC5AR_HH_SPD_Msk        (0x2UL)        /*!< SPD (Bitfield-Mask: 0x01)                             */
 #define R_MIPI_DSI_SQCH1DSC5AR_HH_BTA_Pos        (2UL)          /*!< BTA (Bit 2)                                           */
 #define R_MIPI_DSI_SQCH1DSC5AR_HH_BTA_Msk        (0xcUL)        /*!< BTA (Bitfield-Mask: 0x03)                             */
 #define R_MIPI_DSI_SQCH1DSC5AR_HH_NXACT_Pos      (4UL)          /*!< NXACT (Bit 4)                                         */
 #define R_MIPI_DSI_SQCH1DSC5AR_HH_NXACT_Msk      (0x30UL)       /*!< NXACT (Bitfield-Mask: 0x03)                           */
/* ====================================================  SQCH1DSC6AR_HH  ===================================================== */
 #define R_MIPI_DSI_SQCH1DSC6AR_HH_FMT_Pos        (0UL)          /*!< FMT (Bit 0)                                           */
 #define R_MIPI_DSI_SQCH1DSC6AR_HH_FMT_Msk        (0x1UL)        /*!< FMT (Bitfield-Mask: 0x01)                             */
 #define R_MIPI_DSI_SQCH1DSC6AR_HH_SPD_Pos        (1UL)          /*!< SPD (Bit 1)                                           */
 #define R_MIPI_DSI_SQCH1DSC6AR_HH_SPD_Msk        (0x2UL)        /*!< SPD (Bitfield-Mask: 0x01)                             */
 #define R_MIPI_DSI_SQCH1DSC6AR_HH_BTA_Pos        (2UL)          /*!< BTA (Bit 2)                                           */
 #define R_MIPI_DSI_SQCH1DSC6AR_HH_BTA_Msk        (0xcUL)        /*!< BTA (Bitfield-Mask: 0x03)                             */
 #define R_MIPI_DSI_SQCH1DSC6AR_HH_NXACT_Pos      (4UL)          /*!< NXACT (Bit 4)                                         */
 #define R_MIPI_DSI_SQCH1DSC6AR_HH_NXACT_Msk      (0x30UL)       /*!< NXACT (Bitfield-Mask: 0x03)                           */
/* ====================================================  SQCH1DSC7AR_HH  ===================================================== */
 #define R_MIPI_DSI_SQCH1DSC7AR_HH_FMT_Pos        (0UL)          /*!< FMT (Bit 0)                                           */
 #define R_MIPI_DSI_SQCH1DSC7AR_HH_FMT_Msk        (0x1UL)        /*!< FMT (Bitfield-Mask: 0x01)                             */
 #define R_MIPI_DSI_SQCH1DSC7AR_HH_SPD_Pos        (1UL)          /*!< SPD (Bit 1)                                           */
 #define R_MIPI_DSI_SQCH1DSC7AR_HH_SPD_Msk        (0x2UL)        /*!< SPD (Bitfield-Mask: 0x01)                             */
 #define R_MIPI_DSI_SQCH1DSC7AR_HH_BTA_Pos        (2UL)          /*!< BTA (Bit 2)                                           */
 #define R_MIPI_DSI_SQCH1DSC7AR_HH_BTA_Msk        (0xcUL)        /*!< BTA (Bitfield-Mask: 0x03)                             */
 #define R_MIPI_DSI_SQCH1DSC7AR_HH_NXACT_Pos      (4UL)          /*!< NXACT (Bit 4)                                         */
 #define R_MIPI_DSI_SQCH1DSC7AR_HH_NXACT_Msk      (0x30UL)       /*!< NXACT (Bitfield-Mask: 0x03)                           */
/* ======================================================  SQCH1DSC0BR  ====================================================== */
 #define R_MIPI_DSI_SQCH1DSC0BR_DTSEL_Pos         (24UL)         /*!< DTSEL (Bit 24)                                        */
 #define R_MIPI_DSI_SQCH1DSC0BR_DTSEL_Msk         (0x3000000UL)  /*!< DTSEL (Bitfield-Mask: 0x03)                           */
/* ======================================================  SQCH1DSC1BR  ====================================================== */
 #define R_MIPI_DSI_SQCH1DSC1BR_DTSEL_Pos         (24UL)         /*!< DTSEL (Bit 24)                                        */
 #define R_MIPI_DSI_SQCH1DSC1BR_DTSEL_Msk         (0x3000000UL)  /*!< DTSEL (Bitfield-Mask: 0x03)                           */
/* ======================================================  SQCH1DSC2BR  ====================================================== */
 #define R_MIPI_DSI_SQCH1DSC2BR_DTSEL_Pos         (24UL)         /*!< DTSEL (Bit 24)                                        */
 #define R_MIPI_DSI_SQCH1DSC2BR_DTSEL_Msk         (0x3000000UL)  /*!< DTSEL (Bitfield-Mask: 0x03)                           */
/* ======================================================  SQCH1DSC3BR  ====================================================== */
 #define R_MIPI_DSI_SQCH1DSC3BR_DTSEL_Pos         (24UL)         /*!< DTSEL (Bit 24)                                        */
 #define R_MIPI_DSI_SQCH1DSC3BR_DTSEL_Msk         (0x3000000UL)  /*!< DTSEL (Bitfield-Mask: 0x03)                           */
/* ======================================================  SQCH1DSC4BR  ====================================================== */
 #define R_MIPI_DSI_SQCH1DSC4BR_DTSEL_Pos         (24UL)         /*!< DTSEL (Bit 24)                                        */
 #define R_MIPI_DSI_SQCH1DSC4BR_DTSEL_Msk         (0x3000000UL)  /*!< DTSEL (Bitfield-Mask: 0x03)                           */
/* ======================================================  SQCH1DSC5BR  ====================================================== */
 #define R_MIPI_DSI_SQCH1DSC5BR_DTSEL_Pos         (24UL)         /*!< DTSEL (Bit 24)                                        */
 #define R_MIPI_DSI_SQCH1DSC5BR_DTSEL_Msk         (0x3000000UL)  /*!< DTSEL (Bitfield-Mask: 0x03)                           */
/* ======================================================  SQCH1DSC6BR  ====================================================== */
 #define R_MIPI_DSI_SQCH1DSC6BR_DTSEL_Pos         (24UL)         /*!< DTSEL (Bit 24)                                        */
 #define R_MIPI_DSI_SQCH1DSC6BR_DTSEL_Msk         (0x3000000UL)  /*!< DTSEL (Bitfield-Mask: 0x03)                           */
/* ======================================================  SQCH1DSC7BR  ====================================================== */
 #define R_MIPI_DSI_SQCH1DSC7BR_DTSEL_Pos         (24UL)         /*!< DTSEL (Bit 24)                                        */
 #define R_MIPI_DSI_SQCH1DSC7BR_DTSEL_Msk         (0x3000000UL)  /*!< DTSEL (Bitfield-Mask: 0x03)                           */
/* ======================================================  SQCH1DSC0CR  ====================================================== */
 #define R_MIPI_DSI_SQCH1DSC0CR_FINACT_Pos        (0UL)          /*!< FINACT (Bit 0)                                        */
 #define R_MIPI_DSI_SQCH1DSC0CR_FINACT_Msk        (0x1UL)        /*!< FINACT (Bitfield-Mask: 0x01)                          */
 #define R_MIPI_DSI_SQCH1DSC0CR_AUXOP_Pos         (22UL)         /*!< AUXOP (Bit 22)                                        */
 #define R_MIPI_DSI_SQCH1DSC0CR_AUXOP_Msk         (0x400000UL)   /*!< AUXOP (Bitfield-Mask: 0x01)                           */
 #define R_MIPI_DSI_SQCH1DSC0CR_ACTCODE_Pos       (24UL)         /*!< ACTCODE (Bit 24)                                      */
 #define R_MIPI_DSI_SQCH1DSC0CR_ACTCODE_Msk       (0xff000000UL) /*!< ACTCODE (Bitfield-Mask: 0xff)                         */
/* ======================================================  SQCH1DSC1CR  ====================================================== */
 #define R_MIPI_DSI_SQCH1DSC1CR_FINACT_Pos        (0UL)          /*!< FINACT (Bit 0)                                        */
 #define R_MIPI_DSI_SQCH1DSC1CR_FINACT_Msk        (0x1UL)        /*!< FINACT (Bitfield-Mask: 0x01)                          */
 #define R_MIPI_DSI_SQCH1DSC1CR_AUXOP_Pos         (22UL)         /*!< AUXOP (Bit 22)                                        */
 #define R_MIPI_DSI_SQCH1DSC1CR_AUXOP_Msk         (0x400000UL)   /*!< AUXOP (Bitfield-Mask: 0x01)                           */
 #define R_MIPI_DSI_SQCH1DSC1CR_ACTCODE_Pos       (24UL)         /*!< ACTCODE (Bit 24)                                      */
 #define R_MIPI_DSI_SQCH1DSC1CR_ACTCODE_Msk       (0xff000000UL) /*!< ACTCODE (Bitfield-Mask: 0xff)                         */
/* ======================================================  SQCH1DSC2CR  ====================================================== */
 #define R_MIPI_DSI_SQCH1DSC2CR_FINACT_Pos        (0UL)          /*!< FINACT (Bit 0)                                        */
 #define R_MIPI_DSI_SQCH1DSC2CR_FINACT_Msk        (0x1UL)        /*!< FINACT (Bitfield-Mask: 0x01)                          */
 #define R_MIPI_DSI_SQCH1DSC2CR_AUXOP_Pos         (22UL)         /*!< AUXOP (Bit 22)                                        */
 #define R_MIPI_DSI_SQCH1DSC2CR_AUXOP_Msk         (0x400000UL)   /*!< AUXOP (Bitfield-Mask: 0x01)                           */
 #define R_MIPI_DSI_SQCH1DSC2CR_ACTCODE_Pos       (24UL)         /*!< ACTCODE (Bit 24)                                      */
 #define R_MIPI_DSI_SQCH1DSC2CR_ACTCODE_Msk       (0xff000000UL) /*!< ACTCODE (Bitfield-Mask: 0xff)                         */
/* ======================================================  SQCH1DSC3CR  ====================================================== */
 #define R_MIPI_DSI_SQCH1DSC3CR_FINACT_Pos        (0UL)          /*!< FINACT (Bit 0)                                        */
 #define R_MIPI_DSI_SQCH1DSC3CR_FINACT_Msk        (0x1UL)        /*!< FINACT (Bitfield-Mask: 0x01)                          */
 #define R_MIPI_DSI_SQCH1DSC3CR_AUXOP_Pos         (22UL)         /*!< AUXOP (Bit 22)                                        */
 #define R_MIPI_DSI_SQCH1DSC3CR_AUXOP_Msk         (0x400000UL)   /*!< AUXOP (Bitfield-Mask: 0x01)                           */
 #define R_MIPI_DSI_SQCH1DSC3CR_ACTCODE_Pos       (24UL)         /*!< ACTCODE (Bit 24)                                      */
 #define R_MIPI_DSI_SQCH1DSC3CR_ACTCODE_Msk       (0xff000000UL) /*!< ACTCODE (Bitfield-Mask: 0xff)                         */
/* ======================================================  SQCH1DSC4CR  ====================================================== */
 #define R_MIPI_DSI_SQCH1DSC4CR_FINACT_Pos        (0UL)          /*!< FINACT (Bit 0)                                        */
 #define R_MIPI_DSI_SQCH1DSC4CR_FINACT_Msk        (0x1UL)        /*!< FINACT (Bitfield-Mask: 0x01)                          */
 #define R_MIPI_DSI_SQCH1DSC4CR_AUXOP_Pos         (22UL)         /*!< AUXOP (Bit 22)                                        */
 #define R_MIPI_DSI_SQCH1DSC4CR_AUXOP_Msk         (0x400000UL)   /*!< AUXOP (Bitfield-Mask: 0x01)                           */
 #define R_MIPI_DSI_SQCH1DSC4CR_ACTCODE_Pos       (24UL)         /*!< ACTCODE (Bit 24)                                      */
 #define R_MIPI_DSI_SQCH1DSC4CR_ACTCODE_Msk       (0xff000000UL) /*!< ACTCODE (Bitfield-Mask: 0xff)                         */
/* ======================================================  SQCH1DSC5CR  ====================================================== */
 #define R_MIPI_DSI_SQCH1DSC5CR_FINACT_Pos        (0UL)          /*!< FINACT (Bit 0)                                        */
 #define R_MIPI_DSI_SQCH1DSC5CR_FINACT_Msk        (0x1UL)        /*!< FINACT (Bitfield-Mask: 0x01)                          */
 #define R_MIPI_DSI_SQCH1DSC5CR_AUXOP_Pos         (22UL)         /*!< AUXOP (Bit 22)                                        */
 #define R_MIPI_DSI_SQCH1DSC5CR_AUXOP_Msk         (0x400000UL)   /*!< AUXOP (Bitfield-Mask: 0x01)                           */
 #define R_MIPI_DSI_SQCH1DSC5CR_ACTCODE_Pos       (24UL)         /*!< ACTCODE (Bit 24)                                      */
 #define R_MIPI_DSI_SQCH1DSC5CR_ACTCODE_Msk       (0xff000000UL) /*!< ACTCODE (Bitfield-Mask: 0xff)                         */
/* ======================================================  SQCH1DSC6CR  ====================================================== */
 #define R_MIPI_DSI_SQCH1DSC6CR_FINACT_Pos        (0UL)          /*!< FINACT (Bit 0)                                        */
 #define R_MIPI_DSI_SQCH1DSC6CR_FINACT_Msk        (0x1UL)        /*!< FINACT (Bitfield-Mask: 0x01)                          */
 #define R_MIPI_DSI_SQCH1DSC6CR_AUXOP_Pos         (22UL)         /*!< AUXOP (Bit 22)                                        */
 #define R_MIPI_DSI_SQCH1DSC6CR_AUXOP_Msk         (0x400000UL)   /*!< AUXOP (Bitfield-Mask: 0x01)                           */
 #define R_MIPI_DSI_SQCH1DSC6CR_ACTCODE_Pos       (24UL)         /*!< ACTCODE (Bit 24)                                      */
 #define R_MIPI_DSI_SQCH1DSC6CR_ACTCODE_Msk       (0xff000000UL) /*!< ACTCODE (Bitfield-Mask: 0xff)                         */
/* ======================================================  SQCH1DSC7CR  ====================================================== */
 #define R_MIPI_DSI_SQCH1DSC7CR_FINACT_Pos        (0UL)          /*!< FINACT (Bit 0)                                        */
 #define R_MIPI_DSI_SQCH1DSC7CR_FINACT_Msk        (0x1UL)        /*!< FINACT (Bitfield-Mask: 0x01)                          */
 #define R_MIPI_DSI_SQCH1DSC7CR_AUXOP_Pos         (22UL)         /*!< AUXOP (Bit 22)                                        */
 #define R_MIPI_DSI_SQCH1DSC7CR_AUXOP_Msk         (0x400000UL)   /*!< AUXOP (Bitfield-Mask: 0x01)                           */
 #define R_MIPI_DSI_SQCH1DSC7CR_ACTCODE_Pos       (24UL)         /*!< ACTCODE (Bit 24)                                      */
 #define R_MIPI_DSI_SQCH1DSC7CR_ACTCODE_Msk       (0xff000000UL) /*!< ACTCODE (Bitfield-Mask: 0xff)                         */
/* =====================================================  SQCH1DSC0CR_L  ===================================================== */
 #define R_MIPI_DSI_SQCH1DSC0CR_L_FINACT_Pos      (0UL)          /*!< FINACT (Bit 0)                                        */
 #define R_MIPI_DSI_SQCH1DSC0CR_L_FINACT_Msk      (0x1UL)        /*!< FINACT (Bitfield-Mask: 0x01)                          */
/* =====================================================  SQCH1DSC1CR_L  ===================================================== */
 #define R_MIPI_DSI_SQCH1DSC1CR_L_FINACT_Pos      (0UL)          /*!< FINACT (Bit 0)                                        */
 #define R_MIPI_DSI_SQCH1DSC1CR_L_FINACT_Msk      (0x1UL)        /*!< FINACT (Bitfield-Mask: 0x01)                          */
/* =====================================================  SQCH1DSC2CR_L  ===================================================== */
 #define R_MIPI_DSI_SQCH1DSC2CR_L_FINACT_Pos      (0UL)          /*!< FINACT (Bit 0)                                        */
 #define R_MIPI_DSI_SQCH1DSC2CR_L_FINACT_Msk      (0x1UL)        /*!< FINACT (Bitfield-Mask: 0x01)                          */
/* =====================================================  SQCH1DSC3CR_L  ===================================================== */
 #define R_MIPI_DSI_SQCH1DSC3CR_L_FINACT_Pos      (0UL)          /*!< FINACT (Bit 0)                                        */
 #define R_MIPI_DSI_SQCH1DSC3CR_L_FINACT_Msk      (0x1UL)        /*!< FINACT (Bitfield-Mask: 0x01)                          */
/* =====================================================  SQCH1DSC4CR_L  ===================================================== */
 #define R_MIPI_DSI_SQCH1DSC4CR_L_FINACT_Pos      (0UL)          /*!< FINACT (Bit 0)                                        */
 #define R_MIPI_DSI_SQCH1DSC4CR_L_FINACT_Msk      (0x1UL)        /*!< FINACT (Bitfield-Mask: 0x01)                          */
/* =====================================================  SQCH1DSC5CR_L  ===================================================== */
 #define R_MIPI_DSI_SQCH1DSC5CR_L_FINACT_Pos      (0UL)          /*!< FINACT (Bit 0)                                        */
 #define R_MIPI_DSI_SQCH1DSC5CR_L_FINACT_Msk      (0x1UL)        /*!< FINACT (Bitfield-Mask: 0x01)                          */
/* =====================================================  SQCH1DSC6CR_L  ===================================================== */
 #define R_MIPI_DSI_SQCH1DSC6CR_L_FINACT_Pos      (0UL)          /*!< FINACT (Bit 0)                                        */
 #define R_MIPI_DSI_SQCH1DSC6CR_L_FINACT_Msk      (0x1UL)        /*!< FINACT (Bitfield-Mask: 0x01)                          */
/* =====================================================  SQCH1DSC7CR_L  ===================================================== */
